Repository: 1miiine/Blastty-
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Describe the service
ar: وصف الخدمة
fr: Décrire le service

source: Enter service name
ar: أدخل اسم الخدمة
fr: Entrer le nom du service

source: Service name
ar: اسم الخدمة
fr: Nom du service

source: Update service details
ar: تحديث تفاصيل الخدمة
fr: Mettre à jour les détails du service

source: Add service details
ar: إضافة تفاصيل الخدمة
fr: Ajouter des détails du service

source: Edit your service
ar: تعديل خدمتك
fr: Modifier votre service

source: Create new service
ar: إنشاء خدمة جديدة
fr: Créer un nouveau service

source: Delete service feature coming soon
ar: ميزة حذف الخدمة قريبًا
fr: Fonction Supprimer un service bientôt disponible

source: Edit
ar: تعديل
fr: Modifier

source: Tap to add image
ar: اضغط لإضافة صورة
fr: Touchez pour ajouter une image

source: Remove image
ar: إزالة الصورة
fr: Supprimer l'image

source: Service image
ar: صورة الخدمة
fr: Image du service

source: Select day to add slot
ar: اختر اليوم لإضافة فترة زمنية
fr: Sélectionner un jour pour ajouter un créneau

source: Block time slot
ar: حظر الفترة الزمنية
fr: Bloquer un créneau

source: Block time slot confirmation message
ar: رسالة تأكيد حظر الفترة
fr: Message de confirmation du blocage

source: Block
ar: حظر
fr: Bloquer

source: Mon
ar: الاثنين
fr: Lun

source: Tue
ar: الثلاثاء
fr: Mar

source: Wed
ar: الأربعاء
fr: Mer

source: Thu
ar: الخميس
fr: Jeu

source: Fri
ar: الجمعة
fr: Ven

source: Sat
ar: السبت
fr: Sam

source: Sun
ar: الأحد
fr: Dim

source: Add Time Slot
ar: إضافة فترة زمنية
fr: Ajouter un créneau

source: Edit Time Slot
ar: تعديل الفترة الزمنية
fr: Modifier le créneau

source: Add New Time Slot
ar: إضافة فترة زمنية جديدة
fr: Ajouter un nouveau créneau

source: Edit Existing Time Slot
ar: تعديل الفترة الزمنية الحالية
fr: Modifier le créneau existant

source: Time Slot Details
ar: تفاصيل الفترة الزمنية
fr: Détails du créneau

source: Start Time
ar: وقت البدء
fr: Heure de début

source: Start Time Set To
ar: وقت البدء تم ضبطه على
fr: Heure de début réglée à

source: End Time
ar: وقت الانتهاء
fr: Heure de fin

source: End Time Set To
ar: وقت الانتهاء تم ضبطه على
fr: Heure de fin réglée à

source: Slot Set To Available
ar: الفترة متاحة
fr: Créneau disponible

source: Time Slot Added
ar: تمت إضافة الفترة
fr: Créneau ajouté

source: Time Slot Updated
ar: تم تحديث الفترة
fr: Créneau mis à jour

source: Edit Hours Feature Coming Soon
ar: ميزة تعديل الساعات قريبًا
fr: Fonction Modifier les heures bientôt disponible

source: Your Working Hours
ar: ساعات عملك
fr: Vos heures de travail

source: Set your working hours and availability
ar: تحديد ساعات العمل والتوافر
fr: Définir vos heures de travail et disponibilités

source: Manage your schedule
ar: إدارة جدولك
fr: Gérer votre planning

source: Edit schedule feature coming soon
ar: ميزة تعديل الجدول قريبًا
fr: Fonction Modifier le planning bientôt disponible

source: Edit working hours feature coming soon
ar: ميزة تعديل ساعات العمل قريبًا
fr: Fonction Modifier les heures bientôt disponible

source: Set your availability
ar: تحديد توافرك
fr: Définir vos disponibilités

source: Location and contacts
ar: الموقع وجهات الاتصال
fr: Localisation et contacts

source: Edit location contact feature coming soon
ar: ميزة تعديل الموقع والاتصال قريبًا
fr: Fonction Modifier contacts bientôt disponible

source: Find us here
ar: اعثر علينا هنا
fr: Nous trouver ici

source: Map view by placeholder
ar: عرض الخريطة حسب العنصر النائب
fr: Vue de la carte par placeholder

source: Fail to open map
ar: فشل في فتح الخريطة
fr: Impossible d'ouvrir la carte

source: Open in maps
ar: فتح في الخرائط
fr: Ouvrir dans Maps

source: Contact information
ar: معلومات الاتصال
fr: Informations de contact

source: Fail to make call
ar: فشل في إجراء المكالمة
fr: Impossible d'appeler

source: Mail address
ar: البريد الإلكتروني
fr: Adresse email

source: Fail to send email
ar: فشل في إرسال البريد
fr: Impossible d'envoyer l'email

source: Website
ar: الموقع الإلكتروني
fr: Site web

source: Fail to open website
ar: فشل في فتح الموقع
fr: Impossible d'ouvrir le site

source: Bio
ar: السيرة الذاتية

source: Tell us about yourself
ar: حدثنا عن نفسك
fr: Parlez-nous de vous

source: Enter shop location
ar: أدخل موقع المحل
fr: Entrer l'emplacement du salon

source: Enter your shop name
ar: أدخل اسم المحل
fr: Entrer le nom de votre salon

source: Shop name
ar: اسم المحل
fr: Nom du salon

# enterPhoneNumber
source: Enter your phone number
ar: أدخل رقم الهاتف
fr: Entrer le numéro de téléphone

# updatePersonalAndShopDetails
source: Update your personal and shop details
ar: تحديث معلوماتك الشخصية ومحل العمل
fr: Mettre à jour vos informations personnelles et du salon

# editProfileInfo
source: Edit your profile info
ar: تعديل معلومات الملف الشخصي
fr: Modifier les informations du profil

source: Change avatar feature coming soon
ar: ميزة تغيير الصورة قريبًا
fr: Fonction Changer l'avatar bientôt disponible

source: Profile stats
ar: إحصائيات الملف الشخصي
fr: Statistiques du profil

source: Years of experience
ar: سنوات الخبرة
fr: Années d'expérience

source: Choose from library
ar: اختر من المكتبة
fr: Choisir depuis la bibliothèque

source: Take photo
ar: التقاط صورة
fr: Prendre une photo

source: Remove photo
ar: إزالة الصورة
fr: Supprimer la photo

source: Change profile photo
ar: تغيير صورة الملف الشخصي
fr: Changer la photo de profil

source: Mark all as read feature coming soon
ar: ميزة تعليم الكل كمقروء قريبًا
fr: Fonction Marquer tout comme lu bientôt disponible

source: Your notifications
ar: إشعاراتك
fr: Vos notifications

source: Notifications overview description
ar: وصف عام للإشعارات
fr: Description générale des notifications

source: Recent notifications
ar: الإشعارات الأخيرة
fr: Notifications récentes

source: Notifications feature in progress
ar: ميزة الإشعارات قيد التطوير
fr: Fonctionnalité Notifications en cours

source: Notification details
ar: تفاصيل الإشعار
fr: Détails de la notification

source: Mark as read
ar: تعليم كمقروء
fr: Marquer comme lu

source: Navigate to booking
ar: الذهاب إلى الحجز
fr: Aller à la réservation

source: View booking
ar: عرض الحجز
fr: Voir la réservation

source: Dismissed
ar: تم تجاهله
fr: Ignoré

source: Dismiss
ar: تجاهل
fr: Ignorer

source: Logout functionality coming soon
ar: ميزة تسجيل الخروج قريبًا
fr: Fonction Déconnexion bientôt disponible

source: Booking history
ar: تاريخ الحجز
fr: Historique des réservations

source: Average rating
ar: متوسط التقييم
fr: Note moyenne

source: Total spent
ar: إجمالي المصروف
fr: Total dépensé

source: Client states
ar: حالة العملاء
fr: Statuts des clients

source: Client actions feature coming soon
ar: ميزة إجراءات العملاء قريبًا
fr: Fonction Actions client bientôt disponible

source: Bookings short
ar: الحجوزات
fr: Réservations

# totalSpendShort
source: Total Spend
ar: إجمالي المصروف
fr: Dépenses totales

source: Manage your appointments
ar: إدارة مواعيدك
fr: Gérer vos rendez-vous

source: Bookings overview description
ar: وصف عام للحجوزات
fr: Description générale des réservations

source: Upcoming appointments
ar: المواعيد القادمة
fr: Rendez-vous à venir

source: Client information
ar: معلومات الزبون
fr: Informations client

source: Reschedule feature coming soon
ar: ميزة إعادة الجدولة قريبًا
fr: Fonction Reprogrammer bientôt disponible

source: Cancel feature coming soon
ar: ميزة الإلغاء قريبًا
fr: Fonction Annuler bientôt disponible

source: Filter bookings
ar: تصفية الحجوزات
fr: Filtrer les réservations

source: All
ar: الكل
fr: Tout

source: Pending
ar: قيد الانتظار
fr: En attente

source: Confirmed
ar: مؤكد
fr: Confirmé

source: Cancelled
ar: ملغى
fr: Annulé

source: Date range
ar: نطاق التاريخ
fr: Plage de dates

source: Sort by
ar: الترتيب حسب
fr: Trier par

source: Newest first
ar: الأحدث أولاً
fr: Les plus récents

source: Oldest first
ar: الأقدم أولاً
fr: Les plus anciens

# nameAToZ
source: Name A-Z
ar: الاسم من أ إلى ي
fr: Nom A-Z

# nameZToA
source: Name Z-A
ar: الاسم من ي إلى أ
fr: Nom Z-A

source: Apply
ar: تطبيق
fr: Appliquer

source: End Date
ar: تاريخ الانتهاء
fr: Date de fin

source: Start Date
ar: تاريخ البدء
fr: Date de début

source: Select Date Range
ar: اختر نطاق التاريخ
fr: Sélectionner une plage de dates

source: Date Range Picker Dialog
ar: نافذة اختيار نطاق التاريخ
fr: Sélecteur de plage de dates

source: Average Per Day
ar: المعدل اليومي
fr: Moyenne par jour

source: Best Day
ar: أفضل يوم
fr: Meilleur jour

source: Lowest Day
ar: أقل يوم
fr: Jour le plus bas

source: Days Ago
ar: أيام مضت
fr: Il y a des jours

# trendUp5PercentThisWeek
source: Trend Up 5% This Week
ar: الاتجاه +5٪ هذا الأسبوع
fr: Tendance +5% cette semaine

source: Last Friday to Sunday
ar: من الجمعة إلى الأحد الماضي
fr: Du vendredi au dimanche dernier

source: Hair color trend
ar: اتجاه لون الشعر
fr: Tendance couleur de cheveux

source: Growing service
ar: الخدمة الأكثر نمواً
fr: Service en croissance

source: Second most popular
ar: الثاني الأكثر شعبية
fr: Deuxième plus populaire

source: Beard trim with count
ar: تشذيب اللحية مع العدد
fr: Taille de barbe avec compte

source: Top service
ar: الخدمة الأكثر شعبية
fr: Service le plus populaire

source: Haircut with count
ar: قص الشعر مع العدد
fr: Coupe de cheveux avec compte

source: Service distribution
ar: توزيع الخدمات
fr: Distribution des services

source: Discover your top offerings
ar: اكتشف أفضل عروضك
fr: Découvrez vos meilleures offres

source: Popular services reports
ar: تقارير الخدمات الشعبية
fr: Rapports des services populaires

source: Peak hours report
ar: تقرير ساعات الذروة
fr: Rapport des heures de pointe

source: Identify your busiest times
ar: تحديد أكثر الأوقات ازدحامًا
fr: Identifier vos périodes les plus chargées

source: Weekly peak hours
ar: ساعات الذروة الأسبوعية
fr: Heures de pointe hebdomadaires

source: Morning rush
ar: ازدحام الصباح
fr: Affluence du matin

source: Between 9 and 11 am
ar: بين 9 و 11 صباحًا
fr: Entre 9h et 11h

source: Evening peak
ar: ذروة المساء
fr: Heures de pointe du soir

source: Between 5 and 7 pm
ar: بين 5 و 7 مساءً
fr: Entre 17h et 19h

source: Quiet periods
ar: فترات هادئة
fr: Périodes calmes

source: Midday lunch break
ar: استراحة منتصف النهار
fr: Pause déjeuner

source: Booking Trends Report
ar: تقرير اتجاهات الحجز
fr: Rapport des tendances de réservation

source: Weekly Booking Trend
ar: الاتجاه الأسبوعي للحجوزات
fr: Tendance hebdomadaire des réservations

source: Analyze Booking Patterns
ar: تحليل أنماط الحجز
fr: Analyser les modèles de réservation

source: Busiest Day
ar: أكثر يوم ازدحامًا
fr: Jour le plus chargé

source: Slowest Day
ar: أقل يوم ازدحامًا
fr: Jour le moins chargé

source: Weekend vs Weekday
ar: نهاية الأسبوع مقابل أيام الأسبوع
fr: Week-end vs semaine

source: Higher on Weekends
ar: أعلى في عطلات نهاية الأسبوع
fr: Plus élevé le week-end

source: Analytics Feature In Progress
ar: ميزة التحليلات قي التطوير
fr: Fonctionnalité Analytics en cours

source: Receive Push Alerts
ar: استلام تنبيهات الدفع
fr: Recevoir des alertes push

source: Notification Categories
ar: فئات الإشعارات
fr: Catégories de notifications

source: Notifications Settings
ar: إعدادات الإشعارات
fr: Paramètres des notifications

source: Service Information
ar: معلومات الخدمة
fr: Informations sur le service

source: Slot Set to Unavailable
ar: الفترة غير متاحة
fr: Créneau défini comme indisponible

source: For Day
ar: لليوم
fr: Pour le jour

source: Failed to Open Website
ar: فشل في فتح الموقع
fr: Impossible d'ouvrir le site Web

source: Failed to Send Email
ar: فشل في إرسال البريد الإلكتروني
fr: Impossible d'envoyer l'e-mail

source: Email Address
ar: البريد الإلكتروني
fr: Adresse e-mail

source: Failed to Make Call
ar: فشل في إجراء المكالمة
fr: Impossible de passer l'appel

source: Failed to Open Map
ar: فشل في فتح الخريطة
fr: Impossible d'ouvrir la carte

source: Map View Placeholder
ar: عنصر نائب لعرض الخريطة
fr: Espace réservé pour la carte

source: Location and Contact
ar: الموقع وجهات الاتصال
fr: Localisation et contact

source: Edit Your Profile Info
ar: تعديل معلومات ملفك الشخصي
fr: Modifier les informations de votre profil

source: Update Your Personal and Shop Details
ar: تحديث معلوماتك الشخصية ومحل العمل
fr: Mettre à jour vos informations personnelles et celles du salon

source: Enter Your Email
ar: أدخل بريدك الإلكتروني
fr: Entrez votre e-mail

source: Enter Your Phone Number
ar: أدخل رقم هاتفك
fr: Entrez votre numéro de téléphone

source: Marked as Read
ar: تم تعليمها كمقروءة
fr: Marqué comme lu

# statusOpen
source: Open
ar: مفتوح
fr: Ouvert

# totalSpentShort
source: Total Spent
ar: إجمالي المصروف
fr: Total dépensé

source: Bookings Feature In Progress
ar: ميزة الحجوزات قيد التطوير
fr: Fonctionnalité réservations en cours

source: All Time
ar: كل الوقت
fr: Tout le temps

source: For client
ar: للزبون
fr: Pour le client

source: Yes cancel
ar: نعم ألغي

source: Enter your full name
ar: أدخل اسمك الكامل
fr: Entrez votre nom complet

# confirmBookingDialogTitle
source: Confirm Booking
ar: تأكيد الحجز
fr: Confirmer la réservation

# confirmBookingDialogContent
source: Are you sure you want to confirm the booking for {clientName}?
ar: هل أنت متأكد أنك تريد تأكيد الحجز لـ {clientName} ؟
fr: Êtes-vous sûr de vouloir confirmer la réservation pour {clientName} ?

# cancelBookingDialogTitle
source: Cancel Booking
ar: إلغاء الحجز
fr: Annuler

# cancelBookingDialogContent
source: Are you sure you want to cancel the booking for {clientName}?
ar: هل أنت متأكد أنك تريد إلغاء الحجز لـ {clientName} ؟
fr: Êtes-vous sûr de vouloir annuler la réservation pour {clientName} ?

# genericConfirmStatusChangeDialogTitle
source: Confirm Status Change
ar: تأكيد تغيير الحالة
fr: Confirmer le changement de statut

# genericConfirmStatusChangeDialogContent
source: Are you sure you want to change the status of the booking for {clientName} to {newStatus}?
ar: هل أنت متأكد أنك تريد تغيير حالة الحجز لـ {clientName} إلى {newStatus} ؟
fr: Êtes-vous sûr de vouloir changer le statut de la réservation pour {clientName} en {newStatus} ?

source: Reschedule Booking For
ar: إعادة جدولة الحجز لـ
fr: Reprogrammer la réservation pour

# newDateTimeMustBeDifferent
source: The new date and time must be different from the current one.
ar: يجب أن يكون التاريخ والوقت الجديدان مختلفين عن التاريخ والوقت الحاليين.
fr: La nouvelle date et heure doivent être différentes de l'heure actuelle.

source: Current Booking
ar: الحجز الحالي
fr: Réservation actuelle

source: Select New Date
ar: اختر تاريخًا جديدًا
fr: Sélectionnez une nouvelle date

# pleaseSelectFutureDateTime
source: Please select a future date and time
ar: يرجى اختيار تاريخ ووقت مستقبلي
fr: Veuillez sélectionner une date et une heure futures

source: Booking Rescheduled
ar: تم إعادة جدولة الحجز
fr: Réservation reprogrammée

# cancelBookingConfirmationMessage
source: Are you sure you want to cancel this booking?
ar: هل أنت متأكد من أنك تريد إلغاء هذا الحجز ؟
fr: Êtes-vous sûr de vouloir annuler cette réservation ?

# analyticsOverviewDescription
source: Track your performance, revenue, and customer trends
ar: تتبع أدائك وإيراداتك واتجاهات العملاء
fr: Suivez vos performances, vos revenus et les tendances des clients

source: Business Analytics
ar: التحليلات التجارية
fr: Analyse commerciale

source: No go back
ar: لا عودة
fr: Pas de retour

source: Select new time
ar: حدد وقت جديد
fr: Sélectionnez nouvelle heure

source: Your Reports
ar: تقاريرك
fr: Vos rapports

source: Popular Services Report
ar: تقرير الخدمات الشائعة
fr: Rapport des services populaires

source: Trend
ar: شائع
fr: Tendance

# up5PercentThisWeek
source: Up 5% This Week
ar: زيادة 5٪ هذا الأسبوع
fr: +5 % cette semaine

source: Add Service
ar: إضافة خدمة
fr: Ajouter un service

source: Update Schedule
ar: تحديث الجدول
fr: Mettre à jour le planning

source: Client Stats
ar: إحصائيات العملاء
fr: Statistiques des clients

source: Manage Your Clients
ar: إدارة عملائك
fr: Gérer vos clients

source: Clients Overview Description
ar: وصف عام للعملاء
fr: Description générale des clients

source: Your Clients
ar: عملاؤك
fr: Vos clients

source: Clients Feature In Progress
ar: ميزة العملاء قيد التطوير
fr: Fonctionnalité clients en cours de développement

source: on {date}
ar: في {date}
fr: le {date}

source: Find available professionals
fr: Trouver des professionnels disponibles
