Repository: 1miiine/Blastty-
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: No upcoming bookings for today
ar: لا توجد حجوزات قادمة اليوم
fr: Aucune réservation à venir pour aujourd'hui

source: Weekly Performance
ar: الأداء الأسبوعي
fr: Performance hebdomadaire

source: Today's Agenda
ar: جدول أعمال اليوم
fr: Agenda du jour

# appointmentReminderTitle
source: Appointment Reminder
ar: تذكير بالموعد
fr: Rappel de rendez-vous

# appointmentReminderMessage
source: Your appointment with Barber Ali is in 30 minutes.
ar: موعدك مع الحلاق علي بعد 30 دقيقة.
fr: Votre rendez-vous avec le barbier Ali est dans 30 minutes.

# newPromotionTitle
source: New Promotion
ar: عرض جديد
fr: Nouvelle promotion

# newPromotionMessage
source: Check out our new beard care package! 20% off this week.
ar: تفقد باقة العناية باللحية الجديدة! خصم 20% هذا الأسبوع.
fr: Découvrez notre nouveau forfait soin de barbe ! 20% de réduction cette semaine.

# appointmentConfirmedTitle
source: Appointment Confirmed
ar: تم تأكيد الموعد
fr: Rendez-vous confirmé

# appointmentConfirmedMessage
source: Your booking for tomorrow at 3 PM is confirmed.
ar: تم تأكيد حجزك ليوم غدٍ الساعة 3 مساءً.
fr: Votre réservation pour demain à 15h est confirmée.

# systemUpdateTitle
source: System Update
ar: تحديث النظام
fr: Mise à jour système

# systemUpdateMessage
source: The app has been updated to version 2.1. Enjoy new features!
ar: تم تحديث التطبيق إلى الإصدار 2.1. استمتع بالميزات الجديدة!
fr: L'application a été mise à jour vers la version 2.1. Profitez des nouvelles fonctionnalités !

# specialOfferTitle
source: Special Offer
ar: عرض خاص
fr: Offre spéciale

# specialOfferMessage
source: Refer a friend and get 50 MAD off your next service. Limited time!
ar: أحِل صديقًا واحصل على خصم 50 درهم على خدمتك القادمة. العرض محدود!
fr: Parrainez un ami et obtenez 50 MAD de réduction sur votre prochain service. Offre limitée !

# appointmentCategory
source: Appointment
ar: موعد
fr: Rendez-vous

# promotionCategory
source: Promotion
ar: عرض

# systemCategory
source: System
ar: النظام
fr: Système

source: For You
ar: لك
fr: Pour Vous

# forHim
source: For Men
ar: للرجال
fr: Pour Hommes

# forHer
source: For Women
ar: للنساء
fr: Pour Femmes

# forHimServices
source: Services for Men
ar: خدمات للرجال
fr: Services pour Hommes

# forHerServices
source: Services for Women
ar: خدمات للنساء
fr: Services pour Femmes

# barbersForService
source: Barbers for {serviceName}
ar: حلاقون لخدمة {serviceName}
fr: Barbiers pour {serviceName}

# noBarbersForService
source: No barbers found for {serviceName}.
ar: لم يتم العثور على حلاقين لخدمة {serviceName}.
fr: Aucun barbier trouvé pour {serviceName}.

source: Payment Methods
ar: طرق الدفع
fr: Moyens de Paiement

source: Monday
ar: الاثنين
fr: Lundi

source: Tuesday
ar: الثلاثاء
fr: Mardi

source: Wednesday
ar: الأربعاء
fr: Mercredi

source: Thursday
ar: الخميس
fr: Jeudi

source: Friday
ar: الجمعة
fr: Vendredi

source: Saturday
ar: السبت
fr: Samedi

source: Sunday
ar: الأحد
fr: Dimanche

source: description
ar: وصف

# twoMinutesAgo
source: 2 minutes ago
ar: منذ دقيقتين
fr: Il y a 2 minutes

# oneHourAgo
source: 1 hour ago
ar: منذ ساعة واحدة
fr: Il y a 1 heure

source: Yesterday
ar: أمس
fr: Hier

# twoDaysAgo
source: 2 days ago
ar: منذ يومين
fr: Il y a 2 jours

# threeDaysAgo
source: 3 days ago
ar: منذ ثلاثة أيام
fr: Il y a 3 jours

source: Items
ar: عناصر
fr: Articles

source: Add favorites
ar: أضف المفضلة
fr: Ajouter favoris

# serviceHaircut
source: Haircut
ar: قص الشعر
fr: Coupe de cheveux

# distanceLabel
source: Distance
ar: المسافة

# descriptionLabel
source: Description
ar: الوصف

# serviceBeardTrim
source: Beard Trim
ar: تشذيب اللحية
fr: Taille de barbe

source: Review label
ar: ملصق المراجعة
fr: étiquette de révision

source: Booking confirmed for
ar: تم تأكيد الحجز لـ
fr: Réservation Confirmée Pour

source: All notifications marked as read.
ar: تم وضع علامة على جميع الإشعارات كمقروءة.
fr: Toutes les notifications ont été marquées comme lues.

source: Could not launch {url}
ar: تعذر تشغيل {url}
fr: Impossible de lancer {url}

# faq1Question
source: How do I book an appointment?
ar: كيف أحجز موعداً؟
fr: Comment réserver un rendez-vous ?

source: Services Offered
ar: الخدمات المقدمة
fr: Services Offerts

source: Your Favorite Barbers And Services
ar: الحلاقون والخدمات المفضلة لديك
fr: Vos barbiers et services préférés

# faq1Answer
source: You can book an appointment by selecting a barber, choosing a service and time slot, and confirming your booking.
ar: يمكنك حجز موعد عن طريق اختيار الحلاق، ثم اختيار الخدمة والوقت المناسب، وأخيراً تأكيد الحجز.
fr: Vous pouvez réserver un rendez-vous en sélectionnant un barbier, en choisissant un service et un créneau horaire, puis en confirmant votre réservation.

# faq2Question
source: How can I cancel my appointment?
ar: كيف يمكنني إلغاء موعدى؟
fr: Comment puis-je annuler mon rendez-vous ?

# faq2Answer
source: You can cancel your appointment up to 2 hours before the scheduled time through the "My Appointments" section.
ar: يمكنك إلغاء موعدك حتى ساعتين قبل الموعد المحدد من خلال قسم "مواعيدي".
fr: Vous pouvez annuler votre rendez-vous jusqu'à 2 heures avant l'heure prévue via la section "Mes Rendez-vous".

# faq3Question
source: What payment methods are accepted?
ar: ما طرق الدفع المقبولة؟
fr: Quels modes de paiement sont acceptés ?

# faq3Answer
source: We currently accept cash payments at the barbershop. Card payments are coming soon!
ar: نحن نقبل حالياً الدفع نقداً في الحلاق. سيتم قبول بطاقات الدفع قريباً!
fr: Nous acceptons actuellement les paiements en espèces au salon de coiffure. Les paiements par carte arrivent bientôt !

# faq4Question
source: How do I contact customer support?
ar: كيف يمكنني التواصل مع دعم العملاء؟
fr: Comment contacter le support client ?

# faq4Answer
source: You can reach us via email at support@barberapp.ma or call us at +212 6 12 34 56 78.
ar: يمكنك التواصل معنا عبر البريد الإلكتروني support@barberapp.ma
fr: Vous pouvez nous joindre par e-mail à support@barberapp.ma ou par téléphone au +212 6 12 34 56 78.

source: Male
ar: رجل
fr: Homme

source: Female
ar: امرأة
fr: Femme

source: Share
ar: مشاركة
fr: Partager

source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!
fr: Profil mis à jour avec succès !

source: Please fill all fields correctly.
ar: يرجى ملء جميع الحقول بشكل صحيح.
fr: Veuillez remplir tous les champs correctement.

source: Save
ar: حفظ
fr: Enregistrer

source: Forgot Password?
ar: نسيت كلمة المرور؟
fr: Oublié ?

source: Invalid credentials.
ar: بيانات الاعتماد غير صحيحة.
fr: Identifiants invalides.

source: OR
ar: أو
fr: OU

source: Google Sign-In coming soon!
ar: تسجيل الدخول عبر Google قريبًا!
fr: Connexion Google bientôt disponible !

source: Apple Sign-In coming soon!
ar: تسجيل الدخول عبر Apple قريبًا!
fr: Connexion Apple bientôt disponible !

source: Facebook Sign-In coming soon!
ar: تسجيل الدخول عبر Facebook قريبًا!
fr: Connexion Facebook bientôt disponible !

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte ?

source: Create Account
ar: إنشاء حساب
fr: Créer un Compte

source: Sign up to get started
ar: اشترك للبدء
fr: Inscrivez-vous pour commencer

source: I agree to the
ar: أوافق على
fr: J'accepte les

source: Terms and Conditions
ar: الشروط والأحكام
fr: Conditions Générales

# registrationSuccess
source: Registration successful !
ar: تم التسجيل بنجاح !
fr: Inscription réussie !

# logoutSuccess
source: Logged out successfully!
ar: تم تسجيل الخروج بنجاح!
fr: Déconnexion réussie !

# logoutFailed
source: Logout failed. Please try again.
ar: فشل تسجيل الخروج. يرجى المحاولة مرة أخرى.
fr: Échec de la déconnexion. Veuillez réessayer.

source: Login/Logout
ar: تسجيل الدخول/تسجيل الخروج
fr: Connexion/Déconnexion

# loginLogoutPlaceholder
source: You can implement login or logout here.
ar: يمكنك تنفيذ تسجيل الدخول أو تسجيل الخروج هنا.
fr: Vous pouvez implémenter la connexion ou la déconnexion ici.

# editProfileComingSoon
source: Edit profile feature coming soon!
ar: ميزة تعديل الملف الشخصي قريباً!
fr: La fonction de modification de profil arrive bientôt !

source: Actions
ar: الإجراءات

source: change Language Via AppBar
ar: تغيير اللغة عبر شريط التطبيقات
fr: changer Language Via AppBar

# shareAppMessage
source: Check out this cool barber app!
ar: تحقق من هذا التطبيق الرائع لحلاقة الشعر!
fr: Découvrez cette super application de barbier !

# pleaseAgreeToTerms
source: Please agree to the Terms and Conditions.
ar: يرجى الموافقة على الشروط والأحكام.
fr: Veuillez accepter les Conditions Générales.

# pleaseEnterFullName
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل
fr: Veuillez entrer votre nom complet

# pleaseEnterFirstAndLast
source: Please enter at least first and last name
ar: يرجى إدخال الاسم الأول والأخير على الأقل
fr: Veuillez entrer au moins le prénom et le nom

# pleaseEnterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح
fr: Veuillez saisir un email valide

# pleaseConfirmPassword
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور
fr: Veuillez confirmer votre mot de passe

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل ؟
fr: Vous avez déjà un compte ?

source: Reset Your Password
ar: إعادة تعيين كلمة المرور الخاصة بك
fr: Réinitialisez votre mot de passe

# enterEmailForReset
source: Enter your email and we will send you a link to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك رابطًا لإعادة تعيين كلمة مرورك.
fr: Entrez votre email et nous vous enverrons un lien pour réinitialiser votre mot de passe.

# emailSentTitle
source: Email Sent!
ar: تم إرسال البريد الإلكتروني!
fr: Email Envoyé !

# emailSentInstructions
source: Please check your email
ar: يرجى التحقق من بريدك الإلكتروني
fr: Veuillez vérifier votre email

source: Back to Login
ar: العودة إلى تسجيل الدخول
fr: Retour à la Connexion

# failedToSendResetEmail
source: Failed to send reset email. Please try again.
ar: فشل في إرسال بريد إعادة التعيين. يرجى المحاولة مرة أخرى.
fr: Échec de l'envoi de l'email de réinitialisation. Veuillez réessayer.

# unexpectedError
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.
fr: Une erreur inattendue s'est produite.

source: Introduction
ar: مقدمة

# termsIntroText
source: Welcome to our Blasti App. By accessing or using our services, you agree to be bound by these Terms and Conditions. Please read them carefully.
ar: مرحبًا بك في تطبيق صالون الحلاقة الخاص بنا. من خلال الوصول إلى خدماتنا أو استخدامها، فإنك توافق على الالتزام بهذه الشروط والأحكام. يرجى قراءتها بعناية.
fr: Bienvenue sur notre application de barbershop. En accédant ou en utilisant nos services, vous acceptez d'être lié par ces Conditions Générales. Veuillez les lire attentivement.

source: Eligibility
ar: الأهلية
fr: Admissibilité

# eligibilityText
source: You must be at least 18 years old to use this app. By using the app, you represent and warrant that you meet this eligibility requirement.
ar: يجب أن يكون عمرك 18 عامًا على الأقل لاستخدام هذا التطبيق. باستخدامك للتطبيق، فإنك تقر وتضمن أنك تستوفي شرط الأهلية هذا.
fr: Vous devez avoir au moins 18 ans pour utiliser cette application. En utilisant l'application, vous déclarez et garantissez que vous remplissez cette condition d'éligibilité.

source: Use of Services
ar: استخدام الخدمات
fr: Utilisation des Services

# useOfServicesText
source: You agree to use the app only for lawful purposes and in accordance with these Terms. You shall not:
ar: توافق على استخدام التطبيق لأغراض مشروعة فقط ووفقًا لهذه الشروط. لا يجوز لك:
fr: Vous acceptez d'utiliser l'application uniquement à des fins légales et conformément à ces Conditions. Vous ne devez pas :

# useOfServicesPoint1
source: Violate any laws or regulations.
ar: انتهاك أي قوانين أو لوائح.
fr: Enfreindre des lois ou règlements.

# useOfServicesPoint2
source: Interfere with or disrupt the app or servers.
ar: التدخل أو تعطيل عمل التطبيق أو الخوادم.
fr: Interférer avec ou perturber l'application ou les serveurs.

# useOfServicesPoint3
source: Use the app for any fraudulent or malicious activity.
ar: استخدام التطبيق لأي أغراض احتيالية أو ضارة.
fr: Utiliser l'application à des fins frauduleuses ou malveillantes.

# bookingsText
source: Appointment bookings are subject to availability. We reserve the right to cancel or reschedule appointments. Payment is required at the time of booking unless otherwise stated.
ar: تخضع حجوزات المواعيد للتوفّر. نحتفظ بالحق في إلغاء أو إعادة جدولة المواعيد. يُطلب الدفع وقت الحجز ما لم يُذكر خلاف ذلك.
fr: Les réservations de rendez-vous sont soumises à disponibilité. Nous nous réservons le droit d'annuler ou de reporter des rendez-vous. Le paiement est requis au moment de la réservation, sauf indication contraire.

source: User Accounts
ar: حسابات المستخدمين
fr: Comptes Utilisateurs

# userAccountsText
source: You are responsible for maintaining the confidentiality of your account and password. You agree to notify us immediately of any unauthorized use of your account.
ar: أنت مسؤول عن الحفاظ على سرية حسابك وكلمة المرور الخاصة بك. توافق على إعلامنا فورًا بأي استخدام غير مصرح به لحسابك.
fr: Vous êtes responsable de la confidentialité de votre compte et de votre mot de passe. Vous acceptez de nous notifier immédiatement de toute utilisation non autorisée de votre compte.

source: Intellectual Property
ar: الملكية الفكرية
fr: Propriété Intellectuelle

# intellectualPropertyText
source: All content included in the app, such as text, graphics, logos, and software, is the property of [Your Company Name] or its licensors and protected by copyright and other intellectual property laws.
ar: جميع المحتويات المدرجة في التطبيق، مثل النصوص والرسومات والشعارات والبرمجيات، هي ملك لـ [اسم شركتك] أو المرخصين لها ومحمية بموجب قوانين حقوق الطبع والنشر وغيرها من قوانين الملكية الفكرية.
fr: Tout le contenu inclus dans l'application, tel que les textes, graphismes, logos et logiciels, est la propriété de [Votre Nom d'Entreprise] ou de ses concédants et protégé par les lois sur le droit d'auteur et autres lois sur la propriété intellectuelle.

source: Disclaimer
ar: إخلاء المسؤولية
fr: Clause de Non-Responsabilité

# disclaimerText
source: The app is provided "as is" and "as available" without warranties of any kind, either express or implied. We do not warrant that the app will be uninterrupted or error-free.
ar: يتم توفير التطبيق "كما هو" و"حسب التوفر" دون أي ضمانات من أي نوع، صريحة أو ضمنية. لا نضمن أن يكون التطبيق مستمرًا أو خاليًا من الأخطاء.
fr: L'application est fournie « telle quelle » et « selon disponibilité » sans garantie d'aucune sorte, expresse ou implicite. Nous ne garantissons pas que l'application sera ininterrompue ou exempte d'erreurs.

source: Limitation of Liability
ar: تحديد المسؤولية
fr: Limitation de Responsabilité

# limitationOfLiabilityText
source: In no event shall [Your Company Name] be liable for any indirect, incidental, special, consequential or punitive damages arising out of or related to your use of the app.
ar: في أي حال من الأحوال لن تتحمل [اسم شركتك] المسؤولية عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو تأديبية تنشأ عن أو تتعلق باستخدامك للتطبيق.
fr: En aucun cas [Votre Nom d'Entreprise] ne pourra être tenu responsable des dommages indirects, accessoires, spéciaux, consécutifs ou punitifs découlant de ou liés à votre utilisation de l'application.

source: Governing Law
ar: القانون الحاكم
fr: Droit Applicable

# governingLawText
source: These Terms shall be governed and construed in accordance with the laws of [Your Country], without regard to its conflict of law provisions.
ar: تخضع هذه الشروط وتُفسر وفقًا لقوانين [بلدك]، دون النظر إلى أحكام تضارب القوانين.
fr: Les présentes Conditions seront régies et interprétées conformément aux lois de [Votre Pays], sans égard à ses dispositions relatives aux conflits de lois.

source: Changes to Terms
ar: تغييرات في الشروط
fr: Modifications des Conditions

# changesToTermsText
source: We reserve the right, at our sole discretion, to modify or replace these Terms at any time. What constitutes a material change will be determined at our sole discretion.
ar: نحتفظ بالحق، وفقًا لتقديرنا الوحيد، في تعديل أو استبدال هذه الشروط في أي وقت. ما يُعتبر تغييرًا جوهريًا سيتم تحديده وفقًا لتقديرنا الوحيد.
fr: Nous nous réservons le droit, à notre seule discrétion, de modifier ou de remplacer ces Conditions à tout moment. Ce qui constitue un changement matériel sera déterminé à notre seule discrétion.

source: Contact Us
ar: اتصل بنا
fr: Nous Contacter

# contactUsText
source: If you have any questions about these Terms, please contact us at info@yourbarbershop.com.
ar: إذا كانت لديك أي أسئلة حول هذه الشروط، يرجى الاتصال بنا عبر info@yourbarbershop.com.
fr: Si vous avez des questions concernant ces Conditions, veuillez nous contacter à info@yourbarbershop.com.

# termsAndConditionsDialogTitle
source: Terms & Conditions
ar: الشروط والأحكام
fr: Conditions Générales

# statusCompleted
source: Completed
ar: مكتمل
fr: Terminée

# statusConfirmed
source: Confirmed
ar: مؤكد
fr: Confirmée

# statusPending
source: Pending
ar: قيد الانتظار
fr: En Attente

# statusCanceled
source: Canceled
ar: ملغى
fr: Annulée

source: Currently in Progress
ar: قيد التنفيذ حالياً
fr: Actuellement en Cours

# timeAM
source: AM
ar: ص

# timePM
source: PM
ar: م

source: No available slots for this date
ar: لا توجد مواعيد متاحة لهذا التاريخ
fr: Aucun créneau disponible pour cette date

source: Available time slots
ar: الأوقات المتاحة
fr: Créneaux disponibles

# statusOngoing
source: Ongoing
ar: جاري
fr: En Cours

source: Check-in Status
ar: حالة تسجيل الوصول
fr: Statut

source: Review Count
ar: عدد المراجعات
fr: Nombre d'Avis

source: Select a time slot
ar: اختر وقتًا
fr: Sélectionnez un créneau

source: Client Name
ar: اسم الزبون
fr: Nom du Client

# bookedAt
source: Booked at {time}
ar: تم الحجز في {time}
fr: Réservé à {time}

# barbershop
source: Blasti
ar: صالون الحلاقة

source: Barber Shops
ar: صالونات الحلاقة
fr: Salons de coiffure

source: Shop
ar: المتجر
fr: Boutique

source: Downtown Branch
ar: فرع وسط المدينة

source: Yes
ar: نعم
fr: Oui

# bookingSent
source: Your booking request was sent. You will receive a confirmation soon.
ar: تم إرسال طلب الحجز الخاص بك. ستتلقى تأكيدًا قريبًا.
fr: Votre demande de réservation a été envoyée. Vous recevrez bientôt une confirmation.

# searchBarHint
source: Search for barbers, services...
ar: ابحث عن الحلاقين أو الخدمات...
fr: Rechercher des barbiers & services...

# spaService
source: Spa
ar: منتجع صحي

# facialService
source: Facial
ar: عناية بالوجه
fr: Soin du visage

# bookingConfirmedNow
source: Your booking request was sent. You will receive a confirmation soon.
ar: تم إرسال طلب الحجز. ستتلقى تأكيدًا قريبًا.
fr: Votre demande de réservation a été envoyée. Vous recevrez bientôt une confirmation.

# youHaveBooked
source: You have booked a {service}.
ar: لقد قمت بحجز {service}.
fr: Vous avez réservé un(e) {service}.

source: Available Now
ar: متاح الآن
fr: Disponible maintenant

source: Closed
ar: مغلق
fr: Fermé

# openUntil
source: Open until {time}
ar: مفتوح حتى {time}
fr: Ouvert jusqu’à {time}

source: Review
ar: تقييم
fr: Avis

source: Rating
ar: التقييم
fr: Note

source: City
ar: المدينة
fr: Ville

# locationLabel
source: Location
ar: الموقع
fr: Emplacement

# barberStatus
source: Status
ar: الحالة
fr: Statut

source: Book Appointment
ar: احجز موعدًا
fr: Réserver un rendez-vous

# barberUnavailable
source: Barber currently unavailable
ar: الحلاق غير متاح حاليًا
fr: Coiffeur actuellement indisponible

source: Select Barber
ar: اختر حلاقًا
fr: Sélectionner un coiffeur

# noTimeSlots
source: No available time slots
ar: لا توجد أوقات متاحة
fr: Aucun créneau horaire disponible

source: Loading...
ar: جارٍ التحميل...
fr: Chargement...

# bookingFailed
source: Booking failed. Please try again.
ar: فشل الحجز. الرجاء المحاولة مرة أخرى.
fr: La réservation a échoué. Veuillez réessayer.

source: Open
ar: مفتوح
fr: Ouvert

# confirmBookingButton
source: Confirm Booking
ar: تأكيد الحجز
fr: Confirmer la réservation

source: Select Year
ar: اختر السنة
fr: Sélectionner l'année

source: Select Month
ar: اختر الشهر
fr: Sélectionner le mois

source: Schedule
ar: الجدول
fr: Planifier

# scheduleContentPlaceholder
source: This is where the scheduling UI will be.
ar: هنا سيتم عرض واجهة الجدولة.
fr: Voici où s'affichera l'interface de planification.

source: Select Day
ar: اختر اليوم
fr: Sélectionner le jour

# bookingSuccess
source: Booking Successful
ar: تم الحجز بنجاح
fr: Réservation réussie

# bookingSuccessMessage
source: You have booked a {service} on {date} at {time}.
ar: لقد حجزت {service} في {date} الساعة {time}.
fr: Vous avez réservé un(e) {service} le {date} à {time}.

# noTimeSelected
source: Please select a time slot to proceed.
ar: يرجى تحديد وقت للمتابعة.
fr: Veuillez sélectionner un créneau horaire pour continuer.

# bookNowButton
source: Book Now
ar: احجز الآن
fr: Réserver maintenant

source: Barbers list coming soon...
ar: قائمة الحلاقين ستتوفر قريبًا...
fr: Liste des coiffeurs à venir...

source: Hair Color
ar: صبغة شعر
fr: Coloration

source: Beard Trim
ar: تشذيب اللحية
fr: Taille de barbe

source: Recommended Barbershops
ar: محلات الحلاقة الموصى بها
fr: Salons de coiffure recommandés

source: Near Me
ar: بالقرب مني
fr: Près de moi

source: Top Rated
ar: الأعلى تقييمًا
fr: Les mieux notés

# vipBarbers
source: VIP
ar: كبار الشخصيات

source: Accept Card
ar: يقبل بطاقة
fr: Accepte les cartes

source: Error submitting review.
ar: حدث خطأ أثناء إرسال التقييم.
fr: Erreur lors de l’envoi de l’avis.

source: Review submitted successfully.
ar: تم إرسال التقييم بنجاح.
fr: Avis soumis avec succès.

source: You can only review barbers you have booked with completed booking.
ar: يمكنك تقييم الحلاقين الذين حجزت لديهم وأكملت الحجز فقط.
fr: Vous ne pouvez évaluer que les barbiers avec lesquels vous avez effectué et complété une réservation.

source: Error checking booking history.
ar: حدث خطأ أثناء التحقق من سجل الحجوزات.
fr: Erreur lors de la vérification de l’historique des réservations.

source: You need to be logged in to review.
ar: يجب تسجيل الدخول لترك تقييم.
fr: Vous devez être connecté pour laisser un avis.

source: Please enter your review.
ar: يرجى إدخال تقييمك.
fr: Veuillez saisir votre avis.

# bookLaterConfirmation
source: Do you want to confirm this booking for later?
ar: هل تريد تأكيد هذا الحجز لاحقًا؟
fr: Voulez-vous confirmer cette réservation pour plus tard ?

source: Selected Date & Time
ar: التاريخ والوقت المحددان
fr: Date et heure sélectionnées

source: select services
ar: اختر الخدمات
fr: Sélectionner les services

source: Professionals
ar: المحترفون
fr: Professionnels

# bookingScheduled
source: Your booking has been scheduled successfully.
ar: تم حجز موعدك بنجاح.
fr: Votre réservation a été planifiée avec succès.

# selectDateTimeFirst
source: Please select a date and time first.
ar: الرجاء اختيار التاريخ والوقت أولاً.
fr: Veuillez d'abord sélectionner une date et une heure.

source: from
ar: من
fr: de

source: Back
ar: رجوع
fr: Retour

source: Available Candidates
ar: المترشحون المتاحون
fr: Candidats disponibles

source: Hired Professionals
ar: المهنيون المعينون
fr: Professionnels embauchés

source: Available Seats
ar: المقاعد المتاحة
fr: Places disponibles

source: My Professionals
ar: مهنيِّي
fr: Mes professionnels

source: Filtered Professionals
ar: المهنيون المصفّون
fr: Professionnels filtrés

source: Management Tip
ar: نصيحة للإدارة
fr: Astuce de gestion

source: Total Seats
ar: إجمالي المقاعد
fr: Capacité

source: No professionals match criteria
ar: لا يوجد مهنيون يطابقون المعايير
fr: Aucun professionnel ne correspond aux critères

source: Professionals found
ar: المهنيون الذين تم العثور عليهم
fr: Professionnels trouvés

source: Owner Name
ar: اسم المالك
fr: Nom du propriétaire

# completeProfilePrompt
source: Please complete your profile
ar: يرجى إكمال ملفك الشخصي
fr: Veuillez compléter votre profil

source: Go
ar: اذهب
fr: Aller
