Repository: 1miiine/Blastty-
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Manage your availability
ar: إدارة توافرك
fr: Gérer votre disponibilité

source: Enable Notifications
ar: تفعيل الإشعارات
fr: Activer les notifications

source: Account
ar: الحساب
fr: Compte

source: Version
ar: الإصدار

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم
fr: Aide et support

source: Regular
ar: عادي
fr: Régulière

source: Service insights
ar: تحليلات الخدمات
fr: Aperçus du service

source: Popularity
ar: شعبي
fr: Popularité

source: No Location
ar: لا يوجد موقع
fr: Aucun emplacement

# notificationTimeKey
source: Time
ar: الوقت
fr: Heure

# byMinutes
source: by {minutes} minutes
ar: ب {minutes} دقائق
fr: de {minutes} minutes

# invalidTimeInput
source: Please enter a valid positive number of minutes.
ar: الرجاء إدخال عدد صحيح من الدقائق.
fr: Veuillez saisir un nombre positif de minutes valide.

source: Enter minutes
ar: أدخل الدقائق
fr: Entrez les minutes

# fortyFiveMinutes
source: 45 Minutes
ar: 45 دقيقة

source: Select Postpone Time
ar: حدد وقت التأجيل
fr: Sélectionner le temps de report

# chooseIncrement
source: Choose an increment:
ar: اختر زيادة:
fr: Choisissez un incrément :

source: Or enter custom time:
ar: أو أدخل وقتًا مخصصًا:
fr: Ou entrez un temps personnalisé :

source: Trusted
ar: موثوق
fr: De confiance

source: Years
ar: سنوات
fr: Années

source: Premium
ar: مميز

source: Expert
ar: خبير

source: Recommended
ar: موصى به
fr: Recommandé

source: Experienced
ar: خبير
fr: Expérimentée

source: West Side
ar: الجانب الغربي
fr: Côté Ouest

source: Excellent reputation
ar: سمعة ممتازة
fr: Excellente réputation

source: Highly recommended
ar: موصى به جداً
fr: Hautement recommandé

source: Quick Service
ar: خدمة سريعة
fr: Service rapide

source: Friendly
ar: ودود
fr: Sympathique

source: Special Offer!
ar: عرض خاص!
fr: Offre spéciale !

source: Classic Grooming
ar: العناية الكلاسيكية
fr: Soins Classiques

source: Microblading
ar: تحديد الحواجب

source: Hammam
ar: حمام

source: Laser Hair Removal
ar: إزالة الشعر بالليزر
fr: Épilation au laser

source: Premium Cuts
ar: قصات مميزة
fr: Coupes Premium

source: City Center
ar: وسط المدينة
fr: Centre-Ville

source: Elite Barbershop
ar: صالون النخبة
fr: Barbershop Élite

# commentEmpty
source: Comment cannot be empty
ar: لا يمكن أن يكون التعليق فارغًا
fr: Le commentaire ne peut pas être vide

source: Comment added
ar: تمت إضافة التعليق
fr: Commentaire ajouté

# writeComment
source: Write a comment
ar: اكتب تعليقًا
fr: Écrire un commentaire

source: Add Comment
ar: إضافة تعليق
fr: Ajouter un commentaire

# postSharedMessage
source: Check out {barberName}'s post on bokini! Specialty: {specialty}
ar: تحقق من منشور {barberName} على bokini! التخصص: {specialty}
fr: Découvrez la publication de {barberName} sur bokini! Spécialité : {specialty}

source: Pedicure
ar: تجميل القدمين
fr: Pédicure

source: Braiding
ar: ضفر الشعر
fr: Tressage

source: Make Up
ar: مكياج
fr: Maquillage

source: Tanning
ar: تسمير البشرة
fr: Bronzage

source: Men's Haircut
ar: قص شعر الرجال
fr: Coupe de cheveux Homme

source: Women's Haircut
ar: قص شعر النساء
fr: Coupe de cheveux Femme

source: Classic Shave
ar: حلاقة كلاسيكية
fr: Rasage classique

source: Hot Towel Shave
ar: حلاقة بالمنشفة الساخنة
fr: Rasage à l'eau chaude

source: Basic Beard Trim
ar: تشذيب اللحية الأساسي
fr: Taille de barbe basique

source: Beard Shaping
ar: تشكيل اللحية
fr: Forme de barbe

source: Highlighting
ar: تفتيح خصل الشعر
fr: Mèches

source: Men's SPA
ar: منتجع صحي للرجال
fr: SPA pour homme

source: Women's SPA
ar: منتجع صحي للنساء
fr: SPA pour femme

source: Couple's SPA
ar: منتجع صحي للأزواج
fr: SPA pour couple

source: Bikini Wax
ar: إزالة شعر البكيني
fr: Épilation bikini

source: Updo
ar: تسريحة مرفوعة
fr: Chignon / Coiffure sophistiquée

source: Basic Wash
ar: غسل أساسي
fr: Lavage basique

source: Deep Conditioning
ar: علاج ترطيب عميق
fr: Traitement hydratant profond

source: Post Shared
ar: تم مشاركة المنشور
fr: Publication partagée

# writeYourReviewHint
source: Share your experience...
ar: شارك تجربتك...
fr: Partagez votre expérience...

source: For Men
ar: للرجال
fr: Pour Hommes

source: For Women
ar: للنساء
fr: Pour Femmes

# womensServicesShort
source: Women's
ar: النساء
fr: Femmes

# mensServicesShort
source: Men's
ar: الرجال
fr: Hommes

source: Styling
ar: تصفيفة
fr: Coiffure

source: Makeup
ar: مكياج
fr: Maquillage

source: Additional Info
ar: معلومات إضافية
fr: Infos Supplémentaires

source: Contact
ar: اتصال

source: Share this app
ar: مشاركة هذا التطبيق
fr: Partager cette application

# notificationsEmpty
source: You have no notifications yet.
ar: لا توجد إشعارات حتى الآن.
fr: Vous n'avez pas encore de notifications.

# aboutScreenTitle
source: About the App
ar: حول التطبيق
fr: À propos de l'application

# aboutScreenDescription
source: This is a barbershop booking app designed to simplify appointments.
ar: تطبيق لحجز مواعيد الحلاقة لتبسيط المواعيد.
fr: Ceci est une application de réservation de salon de coiffure conçue pour simplifier les rendez-vous.

# helpDescription
source: Need assistance? Contact our support team for help anytime.
ar: تحتاج للمساعدة؟ تواصل مع فريق الدعم في أي وقت.
fr: Besoin d'aide ? Contactez notre équipe d'assistance à tout moment.

source: Home
ar: الرئيسية
fr: Accueil

source: Barbers
ar: الحلاقين
fr: Coiffeurs

source: Please enter your e-mail
ar: الرجاء إدخال بريدك الإلكتروني
fr: Veuillez saisir votre e-mail

source: No favorites yet.
ar: لا توجد مفضلات بعد.
fr: Aucun favori pour le moment.

# exploreAndAddToFavorites
source: Explore barbers and services, then add them to your favorites for quick access.
ar: استكشف الحلاقين والخدمات، ثم أضفهم إلى مفضلاتك للوصول السريع.
fr: Explorez les barbiers et services, puis ajoutez-les à vos favoris pour un accès rapide.

# favoritesRefreshed
source: Favorites list refreshed!
ar: تم تحديث قائمة المفضلات!
fr: Liste des favoris actualisée !

source: Navigate to
ar: الانتقال إلى
fr: Naviguer vers

source: Added to favorites!
ar: تمت الإضافة إلى المفضلة!
fr: Ajouté aux favoris !

source: Removed from favorites!
ar: تمت الإزالة من المفضلة!
fr: Supprimé des favoris !

source: Notifications refreshed!
ar: تم تحديث الإشعارات!
fr: Notifications actualisées !

source: Notification dismissed
ar: تم تجاهل الإشعار
fr: Notification ignorée

source: Undo
ar: تراجع
fr: Annuler

source: Opened
ar: مفتوح
fr: Ouvert

# alreadyHaveAccountLogin
source: Already have an account? Login
ar: لديك حساب؟ تسجيل الدخول
fr: Vous avez déjà un compte ? Connexion

# searchBarbers
source: Search barbers near you
ar: ابحث عن الحلاقين بالقرب منك
fr: Rechercher des coiffeurs près de chez vous

# noAppointments
source: You have no appointments yet.
ar: ليس لديك مواعيد حالياً.
fr: Vous n'avez pas encore de rendez-vous.

source: Book Now
ar: احجز الآن
fr: Réserver

source: Book Later
ar: احجز لاحقاً
fr: Plus tard

source: Welcome
ar: مرحباً
fr: Bienvenue

# welcomeDescription
source: Book your next haircut easily and quickly.
ar: احجز حلاقة شعرك بسهولة وسرعة.
fr: Réservez votre prochaine coupe facilement et rapidement.

source: Login
ar: تسجيل الدخول
fr: Connexion

source: Register
ar: إنشاء حساب
fr: S'inscrire

source: Light Mode
ar: الوضع الفاتح
fr: Mode clair

source: Email
ar: البريد الإلكتروني

# enterEmail
source: Enter your email
ar: أدخل البريد الإلكتروني
fr: Entrer l'email

# enterValidEmail
source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صحيح.
fr: Veuillez entrer une adresse email valide.

source: Password
ar: كلمة المرور
fr: Mot de passe

# enterPassword
source: Please enter your password.
ar: الرجاء إدخال كلمة المرور.
fr: Veuillez entrer votre mot de passe.

# noAccountRegister
source: Don’t have an account? Register
ar: ليس لديك حساب؟ سجل الآن
fr: Pas de compte ? Inscrivez-vous

source: Name
ar: الاسم
fr: Nom

# enterName
source: Please enter your name
ar: الرجاء إدخال اسمك
fr: Veuillez entrer votre nom

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

# defaultLocation
source: Casablanca
ar: الدار البيضاء

source: Recommended Nearby
ar: موصى بهم بالقرب منك
fr: Recommandé à proximité

source: See all
ar: عرض الكل
fr: Voir tout

source: Beard
ar: لحية
fr: Barbe

source: Massage
ar: تدليك

source: No services found
ar: لم يتم العثور على خدمات
fr: Aucun service trouvé

source: Recommended Barbers
ar: الحلاقون الموصى بهم
fr: Coiffeurs recommandés

source: No barbers found
ar: لم يتم العثور على حلاقين
fr: Aucun coiffeur trouvé

source: Mode
ar: الوضع

source: Dark / Light
ar: فاتح / داكن
fr: Sombre / Clair

# modeSubtitle
source: Dark / Light 🌙
ar: فاتح / داكن 🌙
fr: Sombre / Clair 🌙

# confirmLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# selectDate
source: Select a date
ar: اختر تاريخًا
fr: Sélectionner une date

source: Date
ar: التاريخ

source: OK
ar: حسنًا

source: Available Barbers
ar: الحلاقون المتاحون
fr: Coiffeurs disponibles

# bookingRequestSent
source: Your booking request was sent. You will receive a confirmation soon.
ar: تم إرسال طلب الحجز. ستتلقى تأكيدًا قريبًا.
fr: Votre demande de réservation a été envoyée. Vous recevrez bientôt une confirmation.

source: Book
ar: احجز
fr: Réserver

source: Schedule View
ar: عرض الجدول
fr: Vue planifiée

source: Closing soon
ar: سيغلق قريبًا
fr: Fermeture prochaine

source: Barber Specialty
ar: تخصص الحلاق
fr: Spécialité du coiffeur

# chooseService
source: Choose a service:
ar: اختر خدمة:
fr: Choisissez un service :

# writeYourReview
source: Write your review here...
ar: اكتب تقييمك هنا...
fr: Écrivez votre avis ici...

source: Submit Review
ar: إرسال التقييم
fr: Soumettre l'avis

# reviewSubmitted
source: Thank you! Your review has been submitted.
ar: شكرًا لك! تم إرسال تقييمك.
fr: Merci ! Votre avis a été soumis.

source: You
ar: أنت
fr: Vous

source: Top Barbers
ar: أفضل الحلاقين
fr: Meilleurs coiffeurs

source: Haircut
ar: قصة شعر
fr: Coupe de cheveux

source: Shave
ar: حلاقة
fr: Rasage

source: Coloring
ar: صبغة
fr: Coloration

source: Trending
ar: شائع
fr: Tendance

source: Categories
ar: الفئات
fr: Catégories

source: Hair & Styling
ar: تصفيف الشعر
fr: Coiffure et stylisme

source: Hair Coloring
ar: صبغ الشعر
fr: Coloration capillaire

source: Bridal Styling
ar: تصفيف العروس
fr: Coiffure de mariée

source: Nails
ar: الأظافر
fr: Ongles

source: Eyebrows & Lashes
ar: الحواجب والرموش
fr: Sourcils et cils

source: Barbering
ar: الحلاقة
fr: Barbier

source: Hair Removal
ar: إزالة الشعر
fr: Épilation

source: Facials & Skincare
ar: العناية بالوجه والبشرة
fr: Soins du visage & peau

source: Injectables
ar: الحقن
fr: Produits injectables

source: Body Treatments
ar: علاجات الجسم
fr: Traitements corporels

source: Henna Art
ar: فن الحناء
fr: Art du henné

source: Traditional Hammam
ar: الحمام المغربي التقليدي
fr: Hammam traditionnel

source: Information
ar: معلومات
fr: Informations

source: Unavailable
ar: غير متاح
fr: Indisponible

# fiveMinutes
source: 5 Minutes
ar: 5 دقائق

# tenMinutes
source: 10 Minutes
ar: 10 دقائق

# fifteenMinutes
source: 15 Minutes
ar: 15 دقيقة

source: English
ar: الإنجليزية
fr: Anglais

# french
source: Frensh
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: Arabe

# thirtyMinutes
source: 30 Minutes
ar: 30 دقيقة

# oneHour
source: 1 Hour
ar: ساعة واحدة
fr: 1 Heure

source: Added time to booking
ar: تمت إضافة وقت إلى الحجز
fr: Temps ajouté à la réservation

# messagingFeatureComingSoon
source: Messaging functionality coming soon!
ar: ميزة المراسلة قريباً!
fr: Fonctionnalité de messagerie bientôt disponible !

source: Additional Images
ar: صور إضافية
fr: Images supplémentaires

source: Age
ar: العمر
fr: Âge

source: Phone
ar: الهاتف
fr: Téléphone

source: Address
ar: العنوان
fr: Adresse

source: Gender
ar: الجنس
fr: Genre

# pleaseFillRequiredFields
source: Please fill all required fields
ar: يرجى ملء جميع الحقول المطلوبة
fr: Veuillez remplir tous les champs obligatoires

source: Profile updated !
ar: تم تحديث الملف الشخصي !
fr: Profil mis à jour !

source: Sign in to continue
ar: سجل الدخول للمتابعة
fr: Connectez-vous pour continuer

source: Remember me
ar: تذكرني
fr: Se souvenir de moi

source: language Selector Coming Soon
ar: قريبا تحديد اللغة
fr: Langue Selecteur proche

source: Required field
ar: حقل مطلوب
fr: Champ obligatoire

source: Change picture
ar: تغيير الصورة

source: View picture
ar: عرض الصورة

# noFavorites
source: No favorites yet.
ar: لا توجد مفضلات بعد.
fr: Aucun favori pour le moment.

source: No notifications.
ar: لا توجد إشعارات.
fr: Aucune notification.

# markAllAsRead
source: All Read
ar: تحديد مقروء
fr: Tout lu

source: Frequently Asked Questions
ar: الأسئلة المتكررة
fr: Foire aux questions

source: tools
ar: أدوات
fr: Outils

source: Menu
ar: القائمة

# pleaseFillAllFields
source: Please fill in all fields.
ar: يرجى ملء جميع الحقول.
fr: Veuillez remplir tous les champs.

# aboutAppDescription
source: Easily discover trusted barbers and stylists around you, explore a variety of services, and book appointments in just a few taps. For professionals, showcase your work, manage bookings, track clients, and grow your business with powerful tools—all in one app.
ar: اكتشف بسهولة الحلاقين ومصففي الشعر الموثوقين بالقرب منك، اكتشف مجموعة متنوعة من الخدمات، واحجز مواعيدك ببضع نقرات فقط. أما بالنسبة للمحترفين، فيمكنهم عرض أعمالهم، إدارة الحجوزات، متابعة العملاء، وتطوير أعمالهم باستخدام أدوات قوية — كل ذلك في تطبيق واحد طور بواسطة
fr: Découvrez facilement des barbiers et coiffeurs de confiance près de chez vous, explorez une variété de services et réservez vos rendez-vous en quelques clics. Pour les professionnels, présentez vos services, gérez vos réservations, suivez vos clients et développez votre activité avec des outils puissants — le tout dans une seule application. Développé par

# invalidEmail
source: Invalid email address
ar: بريد إلكتروني غير صالح
fr: Adresse e-mail invalide

# specialtyPremiumBeardCare
source: Premium Beard Care
ar: العناية المميزة باللحية
fr: Soin de barbe premium

# specialtySignatureHaircut
source: Signature Haircut
ar: قصة الشعر المميزة
fr: Coupe signature

# descBarberHaven1
source: A renowned barbershop offering exceptional grooming experiences.
ar: صالون حلاقة مشهور يقدم تجارب حلاقة استثنائية.
fr: Un salon de coiffure réputé offrant des soins exceptionnels.

# descBarberHaven2
source: Expert barbers providing stylish cuts and beard trims.
ar: حلاقون خبراء يقدمون قصات أنيقة وتقليم اللحية.
fr: Des barbiers experts proposant des coupes élégantes et des tailles de barbe.

# descBarberHaven3
source: Comfortable environment with skilled professionals.
ar: بيئة مريحة مع محترفين مهرة.
fr: Environnement confortable avec des professionnels qualifiés.

# descBarberHaven4
source: Top-rated services and personalized care.
ar: خدمات ذات تقييم عالي ورعاية شخصية.
fr: Services très bien notés et soins personnalisés.

# descBarberHaven5
source: Modern techniques with a classic touch.
ar: تقنيات حديثة مع لمسة كلاسيكية.
fr: Techniques modernes avec une touche classique.

source: Barber Haven 1
ar: باربر 1

source: Barber Haven 2
ar: باربر 2

source: Barber Haven 3
ar: باربر 3

source: Barber Haven 4
ar: باربر 4

source: Manage Services
ar: إدارة الخدمات
fr: Gérer les services

source: Goal
ar: الهدف
fr: Objectif

source: Barber Haven 5
ar: 1 باربر

source: Invalid age
ar: عمر غير صالح
fr: Âge invalide

source: Away
ar: بعيد
fr: Loin

source: Notifications enabled
ar: تم تفعيل الإشعارات
fr: Notifications activées

source: Notifications disabled
ar: تم تعطيل الإشعارات
fr: Notifications désactivées

source: Please enter client name
ar: يرجى إدخال اسم الزبون
fr: Veuillez entrer le nom du client

source: Please select service
ar: يرجى اختيار الخدمة
fr: Veuillez sélectionner un service

source: Please select barber
ar: يرجى اختيار الحلاق
fr: Veuillez sélectionner un coiffeur

source: Notes optional
ar: ملاحظات اختيارية
fr: Notes optionnelles

source: Booking added successfully
ar: تمت إضافة الحجز بنجاح
fr: Réservation ajoutée avec succès

source: Add booking
ar: إضافة حجز
fr: Ajouter réservation

source: Revenue breakdown
ar: تفصيل الإيرادات
fr: Répartition des revenus

source: Total
ar: الإجمالي

source: Products
ar: المنتجات
fr: Produits

source: Daily breakdown
ar: تفصيل يومي
fr: Répartition quotidienne

source: Rating breakdown
ar: تفصيل التقييم
fr: Répartition des évaluations

source: Overall rating
ar: التقييم العام
fr: Évaluation globale

source: Based on
ar: استنادًا إلى
fr: Basé sur

source: Rating distribution
ar: توزيع التقييمات
fr: Distribution des notes

source: Recent reviews
ar: التقييمات الأخيرة
fr: Avis récents

source: Great service will come back
ar: خدمة رائعة سوف أعود
fr: Excellent service, je reviendrai

source: Good haircut, but waited
ar: قصّة جيدة، لكن انتظر الزبون
fr: Bonne coupe, mais attente

source: Stars
ar: النجوم
fr: Étoiles

source: Account linking
ar: ربط الحساب
fr: Association de compte

# notificationSettingsDescription
source: Manage how you receive notifications for bookings, reminders, and promotions.
ar: إدارة كيفية تلقيك للإشعارات الخاصة بالحجوزات والتذكيرات والعروض.
fr: Gérez la façon dont vous recevez les notifications pour les réservations, rappels et promotions.

# settingsUpdated
source: Your settings have been updated successfully.
ar: تم تحديث إعداداتك بنجاح.
fr: Vos paramètres ont été mis à jour avec succès.

# bookingRequestsDescription
source: Get notified when you receive new booking requests.
ar: استلم إشعارًا عند وصول طلبات حجز جديدة.
fr: Recevez une notification lorsque vous avez de nouvelles demandes de réservation.

source: Appointment Reminders
ar: تذكيرات المواعيد
fr: Rappels de rendez-vous

# appointmentRemindersDescription
source: Receive reminders before your appointments.
ar: استلم تذكيرات قبل مواعيدك.
fr: Recevez des rappels avant vos rendez-vous.

# messagesDescription
source: Stay updated when you receive new messages.
ar: ابقَ على اطلاع عند استلام رسائل جديدة.
fr: Restez informé lorsque vous recevez de nouveaux messages.

# promotionsDescription
source: Be the first to know about special offers and promotions.
ar: كن أول من يعرف عن العروض الخاصة والتخفيضات.
fr: Soyez le premier à connaître les offres spéciales et promotions.

source: Notification Delivery
ar: طريقة الإشعارات
fr: Mode de notification

source: App Open Only
ar: عند فتح التطبيق فقط
fr: Application ouverte uniquement

# appOpenOnlyDescription
source: You will only receive notifications when the app is open.
ar: ستتلقى الإشعارات فقط عند فتح التطبيق.
fr: Vous recevrez des notifications uniquement lorsque l'application est ouverte.

source: New password changed.
ar: تم تغيير كلمة المرور الجديدة.
fr: Nouveau mot de passe modifié.

source: Feature coming soon.
ar: الميزة قادمة قريباً.
fr: Fonctionnalité bientôt disponible.

source: Change app language
ar: تغيير لغة التطبيق
fr: Changer la langue de l'application

# deleteAccountWarningShort
source: Are you sure you want to delete your account? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف حسابك؟ هذا الإجراء لا يمكن التراجع عنه.
fr: Êtes-vous sûr de vouloir supprimer votre compte ? Cette action est irréversible.

# mondayAbbr
source: Mon
ar: اثن
fr: Lun

# switchAccount
source: Switch ?
ar: تبديل ؟
fr: Changer ?

# tuesdayAbbr
source: Tue
ar: ثلا
fr: Mar

source: Switch to user
ar: التبديل إلى المستخدم
fr: Passer à l'utilisateur

# wednesdayAbbr
source: Wed
ar: أرب
fr: Mer

# thursdayAbbr
source: Thu
ar: خمي
fr: Jeu

# fridayAbbr
source: Fri
ar: جمع
fr: Ven

source: Login successful
ar: تم تسجيل الدخول بنجاح
fr: Connexion réussie

# saturdayAbbr
source: Sat
ar: سبت
fr: Sam

# sundayAbbr
source: Sun
ar: أحد
fr: Dim

source: Weekly performance details
ar: تفاصيل الأداء الأسبوعي
fr: Détails des performances hebdomadaires

source: Account Management
ar: إدارة الحساب
fr: Gestion du compte

source: Switch to Light Mode
ar: التبديل إلى الوضع الفاتح
fr: Passer en mode clair

source: Switch to Dark Mode
ar: التبديل إلى الوضع الداكن
fr: Passer en mode sombre

source: Dark Mode Toggle
ar: تبديل الوضع الداكن
fr: Basculer en mode sombre

source: Generic Error
ar: خطأ عام
fr: Erreur générique

source: Please enter price
ar: يرجى إدخال السعر
fr: Veuillez entrer le prix

source: Please enter service name
ar: يرجى إدخال اسم الخدمة
fr: Veuillez entrer le nom du service

source: Please enter valid price
ar: يرجى إدخال سعر صالح
fr: Veuillez entrer un prix valide

source: Please enter duration
ar: يرجى إدخال المدة
fr: Veuillez entrer la durée

source: Please enter valid duration
ar: يرجى إدخال مدة صالحة
fr: Veuillez entrer une durée valide

source: Popular service description
ar: وصف الخدمة الشائعة
fr: Description du service populaire

source: Mark as popular
ar: وضع علامة كشائع
fr: Marquer comme populaire

source: Update service
ar: تحديث الخدمة
fr: Mettre à jour le service

source: Weekly schedule
ar: الجدول الأسبوعي
fr: Programme hebdomadaire

source: No blocked dates
ar: لا توجد تواريخ محجوبة
fr: Aucune date bloquée

source: Add blocked date
ar: إضافة تاريخ محجوب
fr: Ajouter une date bloquée

source: Analytics refreshed
ar: تم تحديث التحليلات
fr: Analyses actualisées

source: Get from Key
ar: الحصول من المفتاح
fr: Obtenir depuis la clé

source: New Bookings Request
ar: طلبات الحجز الجديدة
fr: Nouvelles demandes de réservation

source: Upcoming Appointment Reminder Title
ar: عنوان تذكير بالموعد القادم
fr: Titre du rappel de rendez-vous à venir

source: Booking Confirmed by Client Title
ar: عنوان الحجز المؤكد من الزبون
fr: Titre de réservation confirmée par le client

source: Service Updated Title
ar: عنوان الخدمة المحدثة
fr: Titre du service mis à jour

source: New Review Received Title
ar: عنوان مراجعة جديدة مستلمة
fr: Titre de nouvel avis reçu

source: New Booking Request Message
ar: رسالة طلب حجز جديد
fr: Message de nouvelle demande de réservation

source: Upcoming Appointment Reminder Message
ar: رسالة تذكير بالموعد القادم
fr: Message de rappel de rendez-vous à venir

source: Booking Confirmed by Client Message
ar: رسالة تأكيد الحجز من الزبون
fr: Message de réservation confirmée par le client

source: Service Updated Message
ar: رسالة تحديث الخدمة
fr: Message de service mis à jour

source: New Review Received Message
ar: رسالة مراجعة جديدة مستلمة
fr: Message de nouvel avis reçu

source: Booking Requests
ar: طلبات الحجز
fr: Demandes de réservation

source: Image URL
ar: رابط الصورة
fr: URL de l'image

source: New Booking Request
ar: طلب حجز جديد
fr: Nouvelle demande de réservation

source: Edit Your Profile
ar: تعديل ملفك الشخصي
fr: Modifier votre profil

source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

source: Please enter specialty
ar: يرجى إدخال التخصص
fr: Veuillez entrer la spécialité

source: Dashboard refreshed
ar: تم تحديث لوحة التحكم
fr: Tableau de bord actualisé

source: Total Clients
ar: إجمالي العملاء
fr: Clients totaux

source: New This Month
ar: جديد هذا الشهر
fr: Nouveaux ce mois-ci

source: No booking history
ar: لا يوجد سجل حجوزات
fr: Aucun historique de réservation

source: No cancelled bookings
ar: لا توجد حجوزات ملغاة
fr: Aucune réservation annulée

source: Mark as complete
ar: وضع علامة كمكتمل
fr: Marquer comme terminé

source: No phone number
ar: لا يوجد رقم هاتف
fr: Aucun numéro de téléphone

source: Detailed Analytics
ar: تحليلات مفصلة
fr: Analyses détaillées

source: System Updates
ar: تحديثات النظام
fr: Mises à jour du système

# dailyBreakdownLabel
source: Daily breakdown
ar: تفصيل يومي
fr: Répartition quotidienne

source: Busy
ar: مشغول
fr: Occupé

source: Very busy
ar: مشغول جدًا
fr: Très occupé

source: Moderate
ar: متوسط
fr: Modéré

source: Light
ar: خفيف
fr: Léger

source: Additional metrics
ar: مقاييس إضافية
fr: Métriques supplémentaires

source: Cancellation rate
ar: معدل الإلغاء
fr: Taux d'annulation

source: Repeat clients
ar: عملاء متكرّرون
fr: Clients réguliers

source: Busiest time
ar: أوقات الذروة
fr: Heure de pointe
