Repository: 1miiine/Blastty-
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# completeProfileForDetails
source: Complete your profile to view details
ar: أكمل ملفك الشخصي لعرض التفاصيل
fr: Complétez votre profil pour voir les détails

source: Not set
ar: غير محدد
fr: Non défini

# incompleteProfileMessage
source: Your profile is incomplete. Please update it to continue.
ar: ملفك الشخصي غير مكتمل. يرجى تحديثه للمتابعة.
fr: Votre profil est incomplet. Veuillez le mettre à jour pour continuer.

source: Select hiring details
ar: تحديد تفاصيل التوظيف
fr: Sélectionner les détails de l’embauche

source: Current
ar: الحالي
fr: Actuel

source: Hired
ar: تم توظيفه
fr: Embauché(e)

# additionalNotesHint
source: Enter any additional notes here
ar: أدخل أي ملاحظات إضافية هنا
fr: Saisissez ici des notes supplémentaires

source: Custom Agreement
ar: اتفاق مخصص
fr: Accord personnalisé

source: Long Term
ar: طويل الأمد
fr: Long terme

source: Short Term
ar: قصير الأمد
fr: Court terme

source: Trial Period
ar: فترة تجريبية
fr: Période d’essai

source: View Contract
ar: عرض العقد
fr: Voir le contrat

source: Edit Details
ar: تعديل التفاصيل
fr: Modifier les détails

source: Remove from Staff
ar: إزالة من الطاقم
fr: Retirer du personnel

source: Details
ar: تفاصيل
fr: Détails

source: Filtered Candidates
ar: المرشحون المصفون
fr: Candidats filtrés

source: Hiring Tip
ar: نصيحة للتوظيف
fr: Astuce pour l’embauche

source: Hire New Professional
ar: توظيف مهني جديد
fr: Nouveau professionnel

# navigateToHireProfessionalsScreen
source: Navigating to professionals hiring screen...
ar: التنقل إلى شاشة توظيف المهنيين...
fr: Navigation vers l'écran d'embauche des professionnels...

source: Barbershop Details
ar: تفاصيل حلاقية
fr: Détails du salon de coiffure

source: Confirm hire
ar: تأكيد التوظيف
fr: Confirmer l'embauche

source: Hire confirmation message
ar: رسالة تأكيد التوظيف
fr: Message de confirmation d'embauche

source: Offer sent to
ar: تم إرسال العرض إلى
fr: Offre envoyée à

source: Emailing
ar: إرسال البريد الإلكتروني
fr: Envoi d'email

source: Calling
ar: جارٍ الاتصال
fr: Appel en cours

source: Clear all
ar: مسح الكل
fr: Tout effacer

source: Staff
ar: الموظفون
fr: Équipe

source: Candidates
ar: المرشحون
fr: Candidats

source: Quick Stats
ar: إحصائيات سريعة
fr: Statistiques Rapides

source: Avg team rating
ar: متوسط تقييم الفريق
fr: Note moyenne de l'équipe

source: Total services offered
ar: إجمالي الخدمات المقدمة
fr: Nombre total de services offerts

source: From your staff
ar: من موظفيك
fr: De votre personnel

source: Avg. Team Experience
ar: متوسط خبرة الفريق
fr: Expérience Moyenne de l'Équipe

source: Hires This Month
ar: التوظيف هذا الشهر
fr: Embauches ce mois

source: No Professionals Found
ar: لا يوجد محترفين
fr: Aucun professionnel trouvé

source: Remove
ar: حذف
fr: Supprimer

# removeConfirmationMessage
source: Are you sure you want to remove this professional?
ar: هل أنت متأكد أنك تريد إزالة هذا المحترف؟
fr: Êtes-vous sûr de vouloir supprimer ce professionnel ?

source: Confirm Removal
ar: تأكيد الإزالة
fr: Confirmer la suppression

source: Removed from Staff
ar: تمت إزالته من الفريق
fr: Supprimé de l'équipe

source: Contract Type
ar: نوع العقد
fr: Type de contrat

source: Experience
ar: الخبرة
fr: Expérience

source: Professionals List
ar: قائمة المحترفين
fr: Liste des professionnels

source: Hire
ar: توظيف
fr: Embaucher

source: Hire Professional
ar: توظيف محترف
fr: Embaucher un professionnel

source: Occupied Seats
ar: المقاعد المشغولة
fr: Places occupées

source: Seats Overview
ar: نظرة عامة على المقاعد
fr: Aperçu des places

# searchProfessionalsHint
source: Search professionals…
ar: ابحث عن المحترفين…
fr: Rechercher des professionnels…

# andText
source: and
ar: و
fr: et

source: more
ar: المزيد
fr: plus

# bookingScheduledSuccessfully
source: Your booking was scheduled successfully.
ar: تم جدولة حجزك بنجاح.
fr: Votre réservation a été programmée avec succès.

source: near you
ar: بالقرب منك
fr: À proximité

# continueText
source: Continue
ar: متابعة
fr: Continuer

source: Filters
ar: الفلاتر
fr: Filtres

# addCommentHint
source: Add a comment...
ar: أضف تعليقًا...
fr: Ajouter un commentaire...

# saloonsBarbersServices
source: Salons & Barbers & Services ...
ar: ... الصالونات & الحلاقون & الخدمات
fr: Salons & Barbiers & Services ...

source: Comments
ar: التعليقات
fr: Commentaires

source: Professionals' Posts
ar: منشورات المحترفين
fr: Publications des professionnels

# noPosts
source: No posts available
ar: لا توجد منشورات متاحة
fr: Aucune publication disponible

# seeAllAction
source: See All
ar: عرض الكل
fr: Voir tout

source: Translate Filter
ar: فلتر الترجمة
fr: Filtre de traduction

# forMenAction
source: For Men
ar: للرجال
fr: Pour hommes

# forWomenAction
source: For Women
ar: للنساء
fr: Pour femmes

# haircutAction
source: Haircut
ar: قص الشعر
fr: Coupe de cheveux

source: Check Out Post
ar: عرض المنشور
fr: Voir la publication

# shaveAction
source: Shave
ar: حلاقة
fr: Rasage

# beardTrimAction
source: Beard Trim
ar: تهذيب اللحية
fr: Taille de barbe

# coloringAction
source: Coloring
ar: تلوين
fr: Coloration

source: Treatment
ar: علاج
fr: Soin

# treatmentAction
source: Treatment
ar: علاج
fr: Soin

# barberHasNoServicesDefined
source: This barber has no services defined.
ar: ليس لدى هذا الحلاق أي خدمات معرفة.
fr: Ce coiffeur n'a aucun service défini.

source: Error
ar: خطأ
fr: Erreur

# withText
source: with
ar: مع
fr: avec

source: Error Submitting Booking
ar: خطأ أثناء إرسال الحجز
fr: Erreur lors de la soumission de la réservation

source: For Service
ar: للخدمة
fr: Pour le service

source: Schedule Booking
ar: جدولة الحجز
fr: Planifier une réservation

source: Selected Services
ar: الخدمات المختارة
fr: Services sélectionnés

# bookingConfirmedNowMultipleServices
source: Booking confirmed now for multiple services.
ar: تم تأكيد الحجز الآن لعدة خدمات.
fr: Réservation confirmée maintenant pour plusieurs services.

# areYouSureBookingForService
source: Are you sure you want to book this service?
ar: هل أنت متأكد من حجز هذه الخدمة؟
fr: Êtes-vous sûr de vouloir réserver ce service ?

source: Booking confirmed now for {service}.
ar: تم تأكيد الحجز الآن لخدمة {service}.
fr: Réservation confirmée maintenant pour {service}.

source: Write review
ar: اكتب مراجعة
fr: Écrire un avis

source: Open Early
ar: يفتح باكرًا
fr: Ouvre tôt

source: Kids Haircut
ar: حلاقة أطفال
fr: Coupe enfant

source: Open Late
ar: يفتح متأخرًا
fr: Ouvre tard

source: Affordable
ar: سعر مناسب
fr: Abordable

# cityCasablanca
source: Casablanca
ar: الدار البيضاء

# cityRabat
source: Rabat
ar: الرباط

# cityMarrakech
source: Marrakech
ar: مراكش

# selectServicesForOneBarberOnly
source: Please select services for one barber only
ar: يرجى اختيار الخدمات لحلاق واحد فقط
fr: Veuillez sélectionner des services pour un seul barbier

source: Find Barbers
ar: ابحث عن الحلاقين
fr: Trouver des coiffeurs

# searchBarPlaceholder
source: Search barbers or services
ar: ابحث عن الحلاقين أو الخدمات
fr: Rechercher des coiffeurs ou services

# bookingUnknownStatusDescription
source: The booking status is unknown.
ar: حالة الحجز غير معروفة.
fr: Le statut de la réservation est inconnu.

# bookingOngoingDescription
source: Your booking is currently ongoing.
ar: حجزك قيد التنفيذ.
fr: Votre réservation est en cours.

# bookingCanceledDescription
source: This booking has been canceled.
ar: تم إلغاء هذا الحجز.
fr: Cette réservation a été annulée.

# bookingPendingDescription
source: Your booking is pending confirmation.
ar: حجزك في انتظار التأكيد.
fr: Votre réservation est en attente de confirmation.

# bookingConfirmedDescription
source: Your booking has been confirmed.
ar: تم تأكيد حجزك.
fr: Votre réservation a été confirmée.

# bookingCompletedDescription
source: Your booking has been completed.
ar: تم الانتهاء من الحجز.
fr: Votre réservation est terminée.

source: Unknown date
ar: تاريخ غير معروف
fr: Date inconnue

source: Booking with
ar: حجز مع
fr: Réservation avec

source: has been canceled
ar: تم إلغاؤه
fr: a été annulée

source: has been postponed by
ar: تم تأجيله بواسطة
fr: a été reportée de

source: has been confirmed
ar: تم تأكيده
fr: a été confirmée

# cancelBookingWarning
source: Are you sure you want to cancel this booking?
ar: هل أنت متأكد أنك تريد إلغاء هذا الحجز ؟
fr: Êtes-vous sûr de vouloir annuler cette réservation ?

source: Postpone
ar: تأجيل
fr: Reporter

# selectPostponeDuration
source: Select a postpone duration
ar: اختر مدة التأجيل
fr: Sélectionnez une durée de report

source: Yes, confirm
ar: نعم، تأكيد
fr: Oui, confirmer

# areYouSureYouWantToCancel
source: Are you sure you want to cancel the booking with
ar: هل أنت متأكد أنك تريد إلغاء هذا الحجز ؟
fr: Êtes-vous sûr de vouloir annuler la réservation avec

# areYouSureYouWantToPostpone
source: Are you sure you want to postpone the booking with
ar: هل أنت متأكد أنك تريد تأجيل الحجز مع
fr: Êtes-vous sûr de vouloir reporter la réservation avec

source: Earn loyalty points
ar: اكسب نقاط الولاء
fr: Gagnez des points de fidélité

source: Replace All
ar: استبدال الكل
fr: Tout remplacer

source: Loyalty Points
ar: نقاط الولاء
fr: Points de fidélité

source: Valid until Nov 30, 2025
ar: صالح حتى 30 نوفمبر 2025
fr: Valable jusqu’au 30 nov. 2025

# bookAnotherAppointmentDiscount
source: Book another appointment and get a discount
ar: احجز موعدًا آخر واحصل على خصم
fr: Réservez un autre rendez-vous et obtenez une réduction

# fifteenPercentOffNextVisit
source: 15% off your next visit
ar: خصم 15% على زيارتك القادمة
fr: -15% sur votre prochaine visite

source: Special Offers
ar: عروض خاصة
fr: Offres spéciales

source: Service Completed
ar: تم إكمال الخدمة
fr: Service terminé

source: Service in Progress
ar: الخدمة قيد التنفيذ
fr: Service en cours

source: Barber confirmed
ar: تم تأكيد الحلاق
fr: Barbier confirmé

source: Booking created
ar: تم إنشاء الحجز
fr: Réservation créée

source: Appointment Timeline
ar: الجدول الزمني للموعد
fr: Historique du rendez-vous

source: Booking Status
ar: حالة الحجز
fr: Statut de la réservation

source: Unknown status
ar: حالة غير معروفة
fr: Statut inconnu

source: Canceled on
ar: تم الإلغاء في
fr: Annulé le

source: Booking has been canceled
ar: تم إلغاء الحجز
fr: La réservation a été annulée

source: Completed on
ar: اكتمل في
fr: Terminé le

# appointmentPendingDescription
source: Your appointment is pending confirmation.
ar: موعدك في انتظار التأكيد.
fr: Votre rendez-vous est en attente de confirmation.

# appointmentCompletedTitle
source: Appointment Completed
ar: تم الانتهاء من الموعد
fr: Rendez-vous terminé

source: Appointment date
ar: تاريخ الموعد
fr: Date du rendez-vous

source: Confirmed by
ar: مؤكد من قبل
fr: Confirmé par

# appointmentStartingNow
source: Your appointment is starting now
ar: موعدك يبدأ الآن
fr: Votre rendez-vous commence maintenant

# hoursShort
source: hrs
ar: س
fr: h

source: Live service in progress
ar: الخدمة جارية
fr: Service en cours

source: Completed successfully
ar: تم بنجاح
fr: Terminé avec succès

source: Confirmed by barber
ar: تم التأكيد من قبل الحلاق
fr: Confirmé par le barbier

source: AM
ar: ص

source: PM
ar: م

# daysShort
source: days
ar: أيام
fr: jours

source: Calculating...
ar: جارٍ الحساب...
fr: Calcul en cours...

source: Until your appointment with
ar: حتى موعدك مع
fr: Jusqu’à votre rendez-vous avec

# arriveTenMinutesEarlyTip
source: Arrive 10 minutes early for your appointment
ar: يرجى الحضور قبل 10 دقائق من الموعد
fr: Arrivez 10 minutes en avance à votre rendez-vous

source: Booking status information
ar: معلومات حالة الحجز
fr: Informations sur le statut de la réservation

source: Appointment status
ar: حالة الموعد
fr: Statut du rendez-vous

# appointmentCanceledDescription
source: Your appointment has been canceled.
ar: تم إلغاء موعدك.
fr: Votre rendez-vous a été annulé.

# appointmentCanceledTitle
source: Appointment canceled
ar: تم إلغاء الموعد
fr: Rendez-vous annulé

# appointmentCompletedDescription
source: Your appointment has been successfully completed.
ar: تم إكمال موعدك بنجاح.
fr: Votre rendez-vous a été complété avec succès.

# serviceInProgressTitle
source: Service in progress
ar: الخدمة قيد التنفيذ
fr: Service en cours

# serviceInProgressDescription
source: Your service is currently in progress.
ar: خدمتك جارية حالياً.
fr: Votre service est actuellement en cours.

# appointmentConfirmedDescription
source: Your appointment has been confirmed.
ar: تم تأكيد موعدك.
fr: Votre rendez-vous a été confirmé.

# appointmentPendingTitle
source: Appointment pending
ar: موعد قيد الانتظار
fr: Rendez-vous en attente

source: Main branch downtown
ar: الفرع الرئيسي وسط المدينة
fr: Agence principale centre-ville

source: Unknown ID
ar: معرّف غير معروف
fr: ID inconnu

source: Booking ID
ar: رقم الحجز
fr: ID de réservation

source: Unknown service
ar: خدمة غير معروفة
fr: Service inconnu

source: Unknown time
ar: وقت غير معروف
fr: Heure inconnue

source: Barber information
ar: معلومات عن الحلاق
fr: Informations sur le barbier

source: Unknown barber
ar: حلاق غير معروف
fr: Barbier inconnu

source: Where ?
ar: أين ؟
fr: Où ?

source: When ?
ar: متى ؟
fr: Quand ?

# pleaseEnterEmail
source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني
fr: Veuillez saisir votre email

# pleaseEnterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور الخاصة بك
fr: Veuillez saisir votre mot de passe

# errorNetwork
source: Network error. Please check your internet connection.
ar: خطأ في الشبكة. تحقق من اتصال الإنترنت.
fr: Erreur réseau. Veuillez vérifier votre connexion internet.

# errorUnknown
source: An unknown error occurred. Please try again.
ar: حدث خطأ غير معروف. حاول مرة أخرى.
fr: Une erreur inconnue s'est produite. Veuillez réessayer.

source: Barber Details
ar: تفاصيل الحلاق
fr: Détails du coiffeur

source: About Barber
ar: عن الحلاق
fr: À propos du coiffeur

# servicesTab
source: Services
ar: الخدمات

# infoTab
source: Info
ar: معلومات
fr: Infos

# reviewsTab
source: Reviews
ar: التقييمات
fr: Avis

source: Book Your Appointment
ar: احجز موعدك
fr: Réservez votre rendez-vous

source: No reviews yet.
ar: لا توجد تقييمات حتى الآن.
fr: Pas encore d'avis.

source: Select Service
ar: اختر خدمة
fr: Sélectionner un service

source: Confirm
ar: تأكيد
fr: Confirmer

source: Service Details
ar: تفاصيل الخدمة
fr: Détails du service

source: Barber: {name}
ar: الحلاق: {name}
fr: Coiffeur : {name}

source: Booking in progress...
ar: جاري تنفيذ الحجز...
fr: Réservation en cours...

# selectServiceToContinue
source: Please select a service to continue.
ar: يرجى اختيار خدمة للمتابعة.
fr: Veuillez sélectionner un service pour continuer.

source: Search
ar: بحث
fr: Rechercher

source: Loading more...
ar: جارٍ تحميل المزيد...
fr: Chargement en cours...

# noResults
source: No results found
ar: لم يتم العثور على نتائج
fr: Aucun résultat trouvé

source: Try again
ar: حاول مرة أخرى
fr: Réessayer

# filterVipTooltip
source: Only show VIP barbers
ar: عرض فقط الحلاقين VIP
fr: Afficher uniquement les coiffeurs VIP

# filterCardTooltip
source: Barbers who accept card payments
ar: الحلاقون الذين يقبلون البطاقات
fr: Coiffeurs acceptant les cartes

# filterKidsTooltip
source: Barbers specializing in kids’ haircuts
ar: الحلاقون المتخصصون في حلاقة الأطفال
fr: Coiffeurs spécialisés pour enfants

source: Km
ar: كم

source: Info
ar: معلومات
fr: Infos

source: MAD
ar: درهم

source: mins
ar: دقائق
fr: min

source: Specialty
ar: التخصص
fr: Spécialité

# reviewsComingSoon
source: Reviews section coming soon...
ar: قسم التقييمات سيتوفر قريبًا...
fr: Section des avis bientôt disponible...

source: Casablanca
ar: الدار البيضاء

# areYouSureBooking
source: Are you sure you want to book this appointment with
ar: هل أنت متأكد من أنك تريد حجز هذا الموعد مع
fr: Êtes-vous sûr de vouloir réserver ce rendez-vous avec

# cityFes
source: Fes
ar: فاس
fr: Fès

source: Rabat
ar: الرباط

# fes
source: Fès
ar: فاس

source: Marrakech
ar: مراكش

source: Select Date & Time
ar: اختر التاريخ والوقت
fr: Sélectionner date & heure

# reviewBy
source: Review by {name}
ar: تقييم بواسطة {name}
fr: Avis de {name}

source: Booking confirmed on
ar: تم تأكيد الحجز في
fr: Réservation confirmée le

# selectAtLeastOneService
source: Please select at least one service.
ar: يرجى اختيار خدمة واحدة على الأقل.
fr: Veuillez sélectionner au moins un service.

# barber1
source: Barber
ar: حلاق
fr: Barbier

# barber2
source: Barber
ar: حلاق
fr: Barbier

# barber3
source: Barber
ar: حلاق
fr: Barbier

source: My Bookings
ar: حجوزاتي
fr: Mes Réservations

source: Past
ar: الماضي
fr: Passé

# noPastBookings
source: No past bookings yet
ar: لا توجد حجوزات سابقة حتى الآن
fr: Aucune réservation passée pour le moment

source: No ongoing bookings
ar: لا توجد حجوزات قيد التنفيذ
fr: Aucune réservation en cours

source: Message
ar: رسالة

source: No past bookings yet
ar: لا توجد حجوزات سابقة حتى الآن
fr: Aucune réservation passée pour le moment

source: Booking feature coming soon!
ar: ميزة الحجز قريباً!
fr: Fonction de réservation bientôt disponible !

source: Started
ar: بدأت
fr: Commencée

source: Est. Completion
ar: الانتهاء المتوقع
fr: Fin Prévue

source: Error opening booking details
ar: خطأ في فتح تفاصيل الحجز
fr: Erreur lors de l'ouverture des détails de la réservation

# postponeBookingMessage
source: Are you sure you want to postpone this booking?
ar: هل أنت متأكد أنك تريد تأجيل هذا الحجز مع
fr: Êtes-vous sûr de vouloir reporter cette réservation ?

source: Send Message
ar: إرسال رسالة
fr: Envoyer un Message

source: Enter your message...
ar: أدخل رسالتك...
fr: Entrez votre message...

source: Send
ar: إرسال
fr: Envoyer

source: Please enter a message.
ar: يرجى إدخال رسالة.
fr: Veuillez entrer un message.

source: Message sent
ar: تم إرسال الرسالة
fr: Message envoyé

# completeBookingMessage
source: Are you sure you want to mark this booking as complete?
ar: هل أنت متأكد أنك تريد وضع علامة على هذا الحجز كمكتمل؟
fr: Êtes-vous sûr de vouloir marquer cette réservation comme terminée ?

source: Booking marked as complete!
ar: تم وضع علامة على الحجز كمكتمل!
fr: Réservation marquée comme terminée !

source: Added 15 minutes to booking!
ar: تمت إضافة 15 دقيقة إلى الحجز!
fr: 15 minutes ajoutées à la réservation !

# timeAdded
source: Added 15 minutes to booking!
ar: تمت إضافة 15 دقيقة إلى الحجز!
fr: 15 minutes ajoutées à la réservation !

# messagingComingSoon
source: Messaging functionality coming soon!
ar: وظيفة المراسلة قريباً!
fr: Fonction de messagerie bientôt disponible !

source: Booking Details
ar: تفاصيل الحجز
fr: Détails de la réservation

source: Barber
ar: حلاق
fr: Coiffeur

source: Calendar
ar: تقويم
fr: Calendrier

source: Access Time
ar: وقت الوصول
fr: Temps d'accès

# bookingConfirmation
source: Your booking request was sent. You will receive a confirmation soon.
ar: تم إرسال طلب الحجز. ستتلقى تأكيدًا قريبًا.
fr: Votre demande de réservation a été envoyée. Vous recevrez bientôt une confirmation.

# confirmBookingNow
source: Confirm Booking
ar: تأكيد الحجز
fr: Confirmer la réservation

# areYouSureBookNow
source: Are you sure you want to book now?
ar: هل أنت متأكد أنك تريد الحجز الآن؟
fr: Êtes-vous sûr de vouloir réserver maintenant ?

source: Push Notifications
ar: تفغيل الإشعارات
fr: Notifications Push

source: Push Notifications Enabled
ar: تم تفعيل الإشعارات
fr: Notifications Push Activées

source: Push Notifications Disabled
ar: تم تعطيل الإشعارات
fr: Notifications Push Désactivées

source: Email Notifications
ar: الإشعارات البريدية
fr: Notifications Email

source: Receive Email Alerts
ar: استلام تنبيهات عبر البريد الإلكتروني
fr: Recevoir des alertes par email

source: Email Notifications Enabled
ar: تم تفعيل الإشعارات البريدية
fr: Notifications Email Activées

source: Email Notifications Disabled
ar: تم تعطيل الإشعارات البريدية
fr: Notifications Email Désactivées

source: SMS Notifications
ar: إشعارات الرسائل النصية
fr: Notifications SMS

source: Receive SMS Alerts
ar: استلام تنبيهات عبر الرسائل النصية
fr: Recevoir des alertes SMS

source: SMS Notifications Enabled
ar: تم تفعيل إشعارات الرسائل النصية
fr: Notifications SMS Activées

source: SMS Notifications Disabled
ar: تم تعطيل إشعارات الرسائل النصية
fr: Notifications SMS Désactivées

source: Booking Reminders
ar: تذكيرات الحجز
fr: Rappels de Réservation

source: Remind Before Appointments
ar: تذكير قبل المواعيد
fr: Rappeler avant les rendez-vous

source: Booking Confirmations
ar: تأكيدات الحجز
fr: Confirmations de Réservation

source: Notify on Booking
ar: إشعار عند الحجز
fr: Notifier lors d'une réservation

source: Cancellations
ar: الإلغاءات
fr: Annulations

source: Notify on Cancellation
ar: إشعار عند الإلغاء
fr: Notifier lors d'une annulation

source: Promotions
ar: العروض

source: Offers and Discounts
ar: العروض والتخفيضات
fr: Offres et Remises

source: Manage Notifications
ar: إدارة الإشعارات
fr: Gérer les notifications

source: Customize Notification Alerts
ar: تخصيص تنبيهات الإشعارات
fr: Personnaliser les alertes de notification

source: Notification Settings
ar: إعدادات الإشعارات
fr: Paramètres des notifications

source: Account Settings
ar: إعدادات الحساب
fr: Paramètres du compte

source: Settings Overview Description
ar: وصف عام للإعدادات
fr: Description générale des paramètres

source: Edit Profile Feature Coming Soon
ar: ميزة تعديل الملف الشخصي قريبًا
fr: Fonction Modifier le profil bientôt disponible

source: Change Password Feature Coming Soon
ar: ميزة تغيير كلمة المرور قريبًا
fr: Fonction Changer le mot de passe bientôt disponible

source: Notification Preferences
ar: تفضيلات الإشعارات
fr: Préférences de notification

source: Notification Preferences Feature Coming Soon
ar: ميزة تفضيلات الإشعارات قريبًا
fr: Fonction Préférences de notification bientôt disponible

source: App Settings
ar: إعدادات التطبيق
fr: Paramètres de l'application

source: Language Feature Coming Soon
ar: ميزة اللغة قريبًا
fr: Fonction Langue bientôt disponible

source: Delete Account Feature Coming Soon
ar: ميزة حذف الحساب قريبًا
fr: Fonction Supprimer le compte bientôt disponible

source: Update Account Details
ar: تحديث بيانات الحساب
fr: Mettre à jour les informations du compte

source: Update Personal Info
ar: تحديث المعلومات الشخصية
fr: Mettre à jour les informations personnelles

source: Secure Your Account
ar: تأمين حسابك
fr: Sécuriser votre compte

source: Update Email
ar: تحديث البريد الإلكتروني
fr: Mettre à jour l'email

source: Change Email Address
ar: تغيير البريد الإلكتروني
fr: Changer l'adresse email

source: Update Email Feature Coming Soon
ar: ميزة تحديث البريد الإلكتروني قريبًا
fr: Fonction Mise à jour email bientôt disponible

source: Update Phone Number
ar: تحديث رقم الهاتف
fr: Mettre à jour le numéro de téléphone

source: Change Phone Number
ar: تغيير رقم الهاتف
fr: Changer le numéro de téléphone

source: Update Phone Feature Coming Soon
ar: ميزة تحديث الهاتف قريبًا
fr: Fonction Mise à jour téléphone bientôt disponible

source: Current Password
ar: كلمة المرور الحالية
fr: Mot de passe actuel

source: Password Changed Successfully
ar: تم تغيير كلمة المرور بنجاح
fr: Mot de passe modifié avec succès

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Êtes-vous sûr de vouloir vous déconnecter ?

source: Delete Service Confirmation Message
ar: رسالة تأكيد حذف الخدمة
fr: Message de confirmation de suppression du service

source: Work in progress message
ar: الميزة قيد التطوير
fr: Fonction en cours de développement

source: Services feature in progress
ar: ميزة الخدمات قيد التطوير
fr: Fonctionnalité Services en cours

source: Services overview description
ar: وصف عام للخدمات
fr: Description générale des services

source: Manage your services
ar: إدارة خدماتك
fr: Gérer vos services

source: Add Service feature coming soon
ar: ميزة إضافة خدمة قريبًا
fr: Fonction Ajouter un service bientôt disponible

source: Service added
ar: تمت إضافة الخدمة
fr: Service ajouté

source: Service updated
ar: تم تحديث الخدمة
fr: Service mis à jour

source: Category
ar: الفئة
fr: Catégorie
