Repository: 1miiine/Blastty-
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Full Name
ar: الاسم الكامل
fr: Nom complet

source: Name cannot be empty
ar: لا يمكن أن يكون الاسم فارغًا
fr: Le nom ne peut pas être vide

# setUpcomingBooking
source: Set Upcoming Booking (Optional)
ar: تحديد حجز قادم (اختياري)
fr: Programmer un rendez-vous (facultatif)

source: Favorite Service
ar: الخدمة المفضلة
fr: Service préféré

# assignTags
source: Assign Tags (Optional)
ar: تعيين علامات (اختياري)
fr: Attribuer des étiquettes (facultatif)

# notesPlaceholder
source: Notes (e.g., hair type, preferences)
ar: ملاحظات (مثلاً: نوع الشعر، التفضيلات)
fr: Notes (ex : type de cheveux, préférences)

source: Client Added Successfully!
ar: تمت إضافة الزبون بنجاح!
fr: Client ajouté avec succès !

source: Save Client
ar: حفظ الزبون
fr: Enregistrer le client

source: Select Time
ar: اختر وقتًا
fr: Sélectionner l'heure

source: on
ar: في
fr: le

# sureCancelBooking
source: Are you sure you want to cancel this booking? The client will be notified.
ar: هل أنت متأكد من إلغاء هذا الحجز ؟ سيتم إعلام الزبون
fr: Êtes-vous sûr d'annuler cette réservation ? Le client sera notifié.

source: Booking Canceled
ar: تم إلغاء الحجز!
fr: Réservation annulée

source: Canceled
ar: ملغى
fr: Annulée

source: Complete Booking
ar: إكمال الحجز
fr: Terminer la réservation

# sureMarkComplete
source: Are you sure you want to mark this booking as complete?
ar: هل أنت متأكد من إكمال هذا الحجز؟
fr: Êtes-vous sûr de marquer cette réservation comme terminée avec

source: Booking Completed!
ar: تم وضع علامة على الحجز كمكتمل!
fr: Réservation terminée !

source: Completed
ar: مكتمل
fr: Terminée

source: No
ar: لا
fr: Non

source: Yes, I'm Sure
ar: نعم، أنا متأكد
fr: Oui, je suis sûr

source: Remind
ar: تذكير
fr: Rappeler

source: for their appointment at
ar: لحجزهم في
fr: pour leur rendez-vous à

source: Reminder sent to
ar: تم إرسال التذكير إلى
fr: Rappel envoyé à

source: Yes, Remind
ar: نعم، تذكير
fr: Oui, rappeler

source: Revenue Report
ar: تقرير الإيرادات
fr: Rapport de Revenus

source: Track Your Earnings Over Time
ar: تتبع أرباحك مع الوقت
fr: Suivez vos gains et votre performance.

source: Weekly Revenue
ar: الإيرادات الاسبوعية
fr: Revenus Hebdomadaires

source: Yearly Revenue
ar: الإيرادات السنوية
fr: Revenus Annuels

source: Key Metrics
ar: المؤشرات الرئيسية
fr: Indicateurs clés

source: Average Revenue
ar: متوسط الإيرادات
fr: Revenus Moyens

source: Best Period
ar: أفضل فترة
fr: Meilleure Période

source: Lowest Period
ar: أدنى فترة
fr: Période la Plus Basse

source: Key Insights
ar: أهم الاستنتاجات
fr: Idées Actionnables

source: Maximize Peak Performance
ar: تعظيم الأداء الذروي
fr: Maximiser les Performances de Pointe

# yourMostProfitablePeriod
source: Your most profitable period is
ar: أكثر فتراتك ربحية هي
fr: Votre période la plus rentable est

# considerRunningPromotions
source: Consider running promotions or extending hours during this time to further boost earnings.
ar: فكر في تشغيل العروض أو إطالة الساعات خلال هذا الوقت لزيادة الأرباح بشكل أكبر.
fr: Envisagez de lancer des promotions ou d'étendre les horaires pendant cette période pour augmenter davantage vos revenus.

source: Boost Quieter Times
ar: تعزيز الأوقات الهادئة
fr: Stimuler les Périodes Calmes

# engageClientsDuringSlowerPeriods
source: Engage clients during slower periods like
ar: شغل العملاء خلال الفترات الأبطأ مثل
fr: Sollicitez les clients pendant les périodes plus calmes comme

# withSpecialOffers
source: with special offers, such as a 'Mid-Week Discount' or loyalty rewards.
ar: مع عروض خاصة، مثل 'خصم منتصف الأسبوع' أو مكافآت الولاء.
fr: avec des offres spéciales, telles qu'une 'Réduction Mi-Semaine' ou des récompenses de fidélité.

# weeklyAbbreviation
source: W
ar: أ
fr: H

# monthlyAbbreviation
source: M
ar: ش

# yearlyAbbreviation
source: Y
ar: س
fr: A

source: Manage Your Account
ar: إدارة حسابك
fr: Gérer Votre Compte

source: Account Actions
ar: إجراءات الحساب
fr: Actions du compte

source: Edit Profile
ar: تعديل الملف الشخصي
fr: Modifier le Profil

# editProfileDescription
source: Update your profile information.
ar: قم بتعديل معلومات ملفك الشخصي.
fr: Modifiez les informations de votre profil personnel.

source: Change Password
ar: تغيير كلمة المرور
fr: Changer le Mot de Passe

# changePasswordDescription
source: Update your account password.
ar: غيّر كلمة مرور حسابك للحفاظ على أمانه.
fr: Modifiez le mot de passe de votre compte pour sécuriser votre compte.

source: Unlink user account
ar: فصل حساب المستخدم
fr: Dissocier le compte utilisateur

source: Link user account
ar: ربط حساب المستخدم
fr: Associer le compte utilisateur

source: Unlink user account description
ar: إلغاء ربط وصف حساب المستخدم
fr: Dissocier la description du compte utilisateur

source: Link user account description
ar: رابط وصف حساب المستخدم
fr: Lien vers la description du compte utilisateur

# unlinkUserAccountConfirmation
source: Are you sure you want to unlink this account?
ar: هل أنت متأكد أنك تريد فصل هذا الحساب؟
fr: Êtes-vous sûr de vouloir dissocier ce compte ?

# linkUserAccountConfirmation
source: Are you sure you want to link this account?
ar: هل أنت متأكد أنك تريد ربط هذا الحساب؟
fr: Êtes-vous sûr de vouloir associer ce compte ?

source: Unlink
ar: فصل
fr: Dissocier

source: Link
ar: ربط
fr: Associer

# servicePremiumHaircut
source: Premium Haircut
ar: حلاقة فاخرة
fr: Coupe Premium

# serviceClassicShave
source: Classic Shave
ar: حلاقة كلاسيكية
fr: Rasage Classique

# accountUnlinked
source: User account unlinked successfully.
ar: تم فصل الحساب.
fr: Compte dissocié.

source: Account linked.
ar: تم ربط الحساب.
fr: Compte associé.

# failedToLinkAccount
source: Failed to link/unlink account. Please try again.
ar: فشل في ربط/فصل الحساب. يرجى المحاولة مرة أخرى.
fr: Échec de la liaison/dissociation du compte. Veuillez réessayer.

source: Danger Zone
ar: منطقة الخطر
fr: Zone Dangereuse

source: Delete Account
ar: حذف الحساب
fr: Supprimer le Compte

source: Delete account description
ar: حذف وصف الحساب
fr: Supprimer la description du compte

source: Delete Account Warning
ar: تحذير حذف الحساب
fr: ATTENTION : Cette action est irréversible ! Une fois votre compte supprimé, toutes vos données, réservations et informations de profil seront définitivement perdues. Vous ne pourrez jamais récupérer ce compte ni les données associées. Êtes-vous absolument sûr de vouloir continuer ?

source: Account deleted.
ar: تم حذف الحساب.
fr: Compte supprimé.

# failedToDeleteAccount
source: Failed to delete account. Please try again.
ar: فشل في حذف الحساب. يرجى المحاولة مرة أخرى.
fr: Échec de la suppression du compte. Veuillez réessayer.

source: Old password
ar: كلمة المرور القديمة
fr: Ancien mot de passe

source: New Password
ar: كلمة المرور الجديدة
fr: Nouveau Mot de Passe

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة
fr: Confirmer le Nouveau Mot de Passe

source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.
fr: Les mots de passe ne correspondent pas.

# passwordTooShort
source: Password must be at least 6 characters.
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل
fr: Le mot de passe doit comporter au moins 6 caractères.

source: Password changed
ar: تم تغيير كلمة المرور
fr: Mot de passe modifié

# failedToLoadProfile
source: Failed to load profile information.
ar: فشل في تحميل الملف الشخصي.
fr: Échec du chargement du profil.

source: Please enter valid years
ar: الرجاء إدخال سنوات صالحة
fr: Veuillez entrer des années valides

source: Instagram Handle
ar: حساب إنستغرام
fr: Pseudo Instagram

# socialAndWebsite
source: Social & Website
ar: وسائل التواصل والموقع
fr: Réseaux sociaux et site web

source: Change
ar: تغيير
fr: Changer

source: Delete
ar: حذف
fr: Supprimer

source: Client since
ar: عميل منذ
fr: Client depuis

source: These slots will be unavailable
ar: هذه الفترات لن تكون متاحة
fr: Ces créneaux seront indisponibles

# takeABreak
source: Break ?
ar: استراحة ؟
fr: Une pause ?

source: End break early
ar: إنهاء الاستراحة مبكرًا
fr: Terminer la pause plus tôt

source: On break
ar: في استراحة
fr: En pause

# pendingBookingsTitle
source: Pending Bookings
ar: الحجوزات المعلقة
fr: Réservations en attente

# tabNew
source: New
ar: جديد
fr: Nouveau

# tabUpcoming
source: Upcoming
ar: القادمة
fr: À venir

# tabHistory
source: History
ar: السجل
fr: Historique

source: No requests here
ar: لا توجد طلبات هنا
fr: Aucune demande ici

# currency
source: MAD
ar: د.م.

# minutesShort
source: min
ar: دقيقة

# minutesLong
source: minutes
ar: دقائق

# buttonReschedule
source: Reschedule
ar: إعادة جدولة
fr: Reporter

# buttonCancel
source: Cancel
ar: إلغاء
fr: Annuler

# buttonConfirm
source: Confirm
ar: تأكيد
fr: Confirmer

# buttonClose
source: Close
ar: إغلاق
fr: Fermer

# detailStatus
source: Status
ar: الحالة
fr: Statut

# detailService
source: Service
ar: الخدمة

# detailTime
source: Time
ar: الوقت
fr: Heure

# detailPrice
source: Price
ar: السعر
fr: Prix

# detailDuration
source: Duration
ar: المدة
fr: Durée

# confirmBookingTitle
source: Confirm Booking
ar: تأكيد عنوان الحجز
fr: Confirmer

# confirmBookingMessage
source: Are you sure you want to confirm this booking ?
ar: هل أنت متأكد أنك تريد الحجز مع {barberName} الآن ؟
fr: Êtes-vous sûr de vouloir confirmer cette réservation ?

# bookingConfirmedSnackbar
source: Booking Confirmed!
ar: تم تأكيد الحجز!
fr: Réservation confirmée !

# cancelBookingTitle
source: Cancel Booking
ar: إلغاء الحجز
fr: Annuler

# cancelBookingMessage
source: Are you sure you want to cancel this booking ? the professional will be notified.
ar: هل أنت متأكد أنك تريد إلغاء هذا الحجز ؟
fr: Êtes-vous sûr de vouloir annuler cette réservation ? Le professionnel sera notifié.

# bookingCanceledSnackbar
source: Booking Canceled
ar: تم إلغاء الحجز
fr: Réservation annulée

# rescheduleTitle
source: Reschedule Booking
ar: إعادة جدولة الحجز
fr: Reporter la réservation

# rescheduleMessage
source: Select a time to postpone by, or enter a custom amount in minutes.
ar: حدد وقتًا للتأجيل، أو أدخل قيمة مخصصة بالدقائق.
fr: Sélectionnez une durée de report ou entrez un montant personnalisé en minutes.

# rescheduleConfirmMessage
source: Are you sure you want to postpone
ar: هل أنت متأكد من أنك تريد التأجيل لمدة
fr: Êtes-vous sûr de vouloir reporter de

# rescheduledSnackbar
source: Rescheduled
ar: تم التأجيل لمدة
fr: Reporté de

# customMinutesLabel
source: Custom Minutes
ar: دقائق مخصصة
fr: Minutes personnalisées

# dialogNo
source: No
ar: لا
fr: Non

# dialogYesImSure
source: Yes, I'm Sure
ar: نعم، أنا متأكد
fr: Oui, je suis sûr

source: Custom break duration
ar: مدة الاستراحة المخصصة
fr: Durée de pause personnalisée

source: Custom
ar: مخصص
fr: Personnalisé

source: Could not load profile
ar: تعذر تحميل الملف الشخصي
fr: Impossible de charger le profil

source: No bio available
ar: لا توجد سيرة ذاتية
fr: Aucune biographie disponible

source: Not available
ar: غير متاح
fr: Non disponible

# statYearsOfExperience
source: Years of Experience
ar: سنوات الخبرة
fr: Années d'expérience

# statCompletionRate
source: Completion Rate
ar: معدل الإنجاز
fr: Taux d'achèvement

# statAverageRating
source: Average Rating
ar: التقييم المتوسط
fr: Note moyenne

source: Language changed to
ar: تم تغيير اللغة إلى
fr: Langue changée en

source: Theme changed to
ar: تم تغيير النمط إلى
fr: Thème changé en

# deleteAccountConfirmation
source: Are you sure you want to delete your account?
ar: هل أنت متأكد أنك تريد حذف حسابك؟
fr: Êtes-vous sûr de vouloir supprimer votre compte ?

source: Current Language
ar: اللغة الحالية
fr: Langue actuelle

source: No absences scheduled
ar: لا توجد غيابات مجدولة
fr: Aucune absence planifiée

source: Add absence
ar: إضافة غياب
fr: Ajouter une absence

source: Block date ranges for holidays
ar: حظر فترات العطلات
fr: Bloquer les périodes de vacances

source: Manage absences
ar: إدارة الغياب
fr: Gérer les absences

source: Set break
ar: تعيين استراحة
fr: Définir la pause

source: Break time
ar: وقت الاستراحة
fr: Temps de pause

source: This is a day off
ar: هذا يوم عطلة
fr: Ceci est un jour de repos

source: This schedule will apply to all weeks
ar: سيتم تطبيق هذا الجدول على جميع الأسابيع
fr: Cet horaire s'appliquera à toutes les semaines

source: Schedule saved successfully
ar: تم حفظ الجدول بنجاح
fr: Horaire enregistré avec succès

source: Save template
ar: حفظ القالب
fr: Enregistrer le modèle

source: Key Business Metrics
ar: مؤشرات الأعمال الرئيسية
fr: Indicateurs clés de l’entreprise

source: New Customers
ar: عملاء جدد
fr: Nouveaux clients

source: Completed Bookings
ar: الحجوزات المكتملة
fr: Réservations terminées

source: Canceled Bookings
ar: الحجوزات الملغاة
fr: Réservations annulées

source: No-Show Rate
ar: معدل عدم الحضور
fr: Taux d'absence

source: This day is marked as closed.
ar: .هذا اليوم محدد كيوم مغلق
fr: Ce jour est marqué comme fermé.

# scheduleCommandCenter
source: Schedule Management
ar: إدارة المواعيد الزمنية
fr: Gestion Des Horaires

source: Growth Rate Analysis
ar: تحليل معدل النمو
fr: Analyse du taux de croissance

source: Monthly Growth Rate
ar: معدل النمو الشهري
fr: Taux de croissance mensuel

source: Default Hours
ar: ساعات افتراضية

source: Clear
ar: مسح

source: Select All
ar: تحديد الكل

source: New Bookings
ar: حجوزات جديدة

source: Day Status
ar: حالة اليوم

source: Yearly Growth Rate
ar: معدل النمو السنوي
fr: Taux de croissance annuel

source: Total Reviews
ar: إجمالي المراجعات
fr: Avis totaux

source: Performance Details
ar: تفاصيل الأداء
fr: Détails de performance

source: Detailed Performance Metrics
ar: مؤشرات الأداء التفصيلية
fr: Indicateurs de performance détaillés

source: On-Time Arrival
ar: الوصول في الوقت المحدد
fr: Arrivée à l’heure

source: Average Service Time
ar: متوسط وقت الخدمة
fr: Durée moyenne du service

source: Rebooking Rate
ar: معدل إعادة الحجز
fr: Taux de re-réservation

source: Efficiency Insights
ar: رؤى الكفاءة
fr: Aperçus d’efficacité

source: Improve Service Speed
ar: تحسين سرعة الخدمة
fr: Améliorer la rapidité du service

source: Boost Customer Retention
ar: زيادة الاحتفاظ بالعملاء
fr: Augmenter la fidélisation client

source: Customer Retention
ar: الاحتفاظ بالعملاء
fr: Fidélisation de la clientèle

source: AI Insights
ar: رؤى الذكاء الاصطناعي
fr: Analyses IA

source: Look Up
ar: ابحث عن
fr: chercher

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: No data available
ar: لا توجد بيانات متاحة
fr: Aucune donnée disponible

source: Quick Actions
ar: إجراءات سريعة
fr: Actions rapides

source: Growth Recommendations
ar: توصيات النمو
fr: Recommandations de croissance

source: Strategic Insights
ar: رؤى استراتيجية
fr: Aperçus stratégiques

source: Predicted Revenue
ar: الإيرادات المتوقعة
fr: Revenus prévus

source: Predicted Bookings
ar: الحجوزات المتوقعة
fr: Réservations prévues

# locationServicesDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة.
fr: Les services de localisation sont désactivés.

source: Location permission denied.
ar: تم رفض إذن الموقع.
fr: Autorisation de localisation refusée.

source: Location permission permanently denied.
ar: تم رفض إذن الموقع بشكل دائم.
fr: Autorisation de localisation refusée de façon permanente.

source: Failed to get location.
ar: فشل في الحصول على الموقع.
fr: Échec de l’obtention de la localisation.

# pleaseFillSeatDetails
source: Please fill in seat details.
ar: يرجى ملء تفاصيل المقاعد.
fr: Veuillez remplir les détails des sièges.

source: Total seats must be positive.
ar: يجب أن يكون إجمالي المقاعد رقمًا موجبًا.
fr: Le nombre total de sièges doit être positif.

source: Occupied seats cannot be negative.
ar: لا يمكن أن تكون المقاعد المشغولة سالبة.
fr: Les sièges occupés ne peuvent pas être négatifs.

# occupiedSeatsCannotExceedTotal
source: Occupied seats cannot exceed total seats.
ar: لا يمكن أن تتجاوز المقاعد المشغولة إجمالي المقاعد.
fr: Les sièges occupés ne peuvent pas dépasser le total.

source: Salon Type
ar: نوع الصالون
fr: Type de salon

source: Professional Type
ar: نوع المهني
fr: Type de professionnel

source: Please select
ar: يرجى الاختيار
fr: Veuillez sélectionner

source: Men
ar: رجال
fr: Hommes

source: Women
ar: نساء
fr: Femmes

source: Open Now
ar: مفتوح الآن
fr: Ouvert maintenant

source: Kids Friendly
ar: مناسب للأطفال
fr: Adapté aux enfants

source: Image added
ar: تمت إضافة الصورة
fr: Image ajoutée

source: Failed to add image
ar: فشل في إضافة الصورة
fr: Échec de l'ajout de l'image

source: Confirm Deletion
ar: تأكيد الحذف
fr: Confirmer la suppression

# deleteImagesConfirmation
source: Are you sure you want to delete the selected images?
ar: هل أنت متأكد أنك تريد حذف الصور المحددة؟
fr: Êtes-vous sûr de vouloir supprimer les images sélectionnées ?

source: Images deleted
ar: تم حذف الصور
fr: Images supprimées

source: Failed to delete images
ar: فشل في حذف الصور
fr: Échec de la suppression des images

source: Select one image to set as main
ar: اختر صورة واحدة لتعيينها كصورة رئيسية
fr: Sélectionnez une image comme principale

source: Profile image updated
ar: تم تحديث صورة الملف الشخصي
fr: Photo de profil mise à jour

source: Failed to update profile image
ar: فشل في تحديث صورة الملف الشخصي
fr: Échec de la mise à jour de la photo de profil

source: Selected
ar: محدد
fr: Sélectionné

source: Images
ar: الصور

source: Add Image
ar: إضافة صورة
fr: Ajouter une image

source: Close late
ar: يغلق متأخراً
fr: Ferme tard

source: Show favorites
ar: عرض المفضلات
fr: Afficher les favoris

source: Use as main image
ar: استخدام كصورة رئيسية
fr: Utiliser comme image principale

source: Accepts Card
ar: يقبل البطاقة
fr: Carte acceptée

source: VIP
ar: كبار الشخصيات

source: Amenities
ar: وسائل الراحة
fr: Commodités

source: Both
ar: كلاهما
fr: Les deux

source: Gallery
ar: معرض الصور
fr: Galerie

source: Show all images
ar: عرض جميع الصور
fr: Afficher toutes les images

source: No favorite images
ar: لا توجد صور مفضلة
fr: Aucune image favorite

source: No images available
ar: لا توجد صور متاحة
fr: Aucune image disponible

# tapHeartToFavorite
source: Tap the heart to favorite
ar: اضغط على القلب للإضافة إلى المفضلة
fr: Appuyez sur le cœur pour ajouter aux favoris

source: View Gallery
ar: عرض المعرض
fr: Voir la Galerie

source: Business Name
ar: اسم النشاط
fr: Nom de l’entreprise

source: Business Information
ar: معلومات النشاط
fr: Informations sur l’entreprise

source: Solo Professional
ar: مهني مستقل
fr: Indépendant

# professionalRegisterSubtitle
source: Register to connect with clients and grow your business
ar: سجّل لتتواصل مع العملاء وتنمّي عملك
fr: Inscrivez-vous pour entrer en contact avec des clients et développer votre activité

# professionalCreateAccount
source: Create Account
ar: إنشاء حساب
fr: Créer un compte

# professionalRegisterTitle
source: Professional Registration
ar: تسجيل المهنيين
fr: Inscription professionnelle

source: Professional registration successful.
ar: تم تسجيل المهني بنجاح.
fr: Inscription du professionnel réussie.

# locationPluginError
source: Location plugin error occurred.
ar: حدث خطأ في إضافة الموقع.
fr: Une erreur du plugin de localisation s’est produite.

source: Solo Barber
ar: حلاق فردي
fr: Indépendant

# saloonName
source: Salon Name
ar: اسم الصالون
fr: Nom du salon

# personalContactInfo
source: Personal Contact Information
ar: معلومات الاتصال الشخصية
fr: Informations de contact personnelles

# saloonInformation
source: Salon Information
ar: معلومات الصالون
fr: Informations sur le salon

# saloonRegisterSubtitle
source: Register your salon to reach more clients and grow your business
ar: سجّل صالونك للوصول إلى المزيد من العملاء وتنمية عملك
fr: Inscrivez votre salon pour atteindre plus de clients et développer votre activité

# saloonRegisterTitle
source: Salon Registration
ar: تسجيل الصالون
fr: Inscription du salon

# saloonCreateAccount
source: Create Account
ar: إنشاء حساب
fr: Créer un compte

source: Please enter salon name
ar: يرجى إدخال اسم الصالون
fr: Veuillez saisir le nom du salon

# saloonRegistrationSuccessful
source: Salon registration successful.
ar: تم تسجيل الصالون بنجاح.
fr: Inscription du salon réussie.

source: Salon Owner
ar: صاحب صالون
fr: Propriétaire

source: Seat Information
ar: معلومات المقاعد
fr: Informations sur les sièges

source: Please select gender
ar: الرجاء تحديد الجنس
fr: Veuillez sélectionner le sexe

# barberDontHaveAccount
source: Don't have a barber account?
ar: ليس لديك حساب حلاق؟
fr: Vous n'avez pas de compte ?

# barberSignInToContinue
source: Sign in to manage your salon.
ar: سجل الدخول لإدارة صالونك.
fr: Connectez-vous pour gérer votre salon.

# barberWelcomeBack
source: Welcome Back, Barber!
ar: مرحبًا بعودتك، أيها الحلاق!
fr: Bon retour, Coiffeur !

# barberLoginTitle
source: Barber Login
ar: تسجيل دخول الحلاق
fr: Connexion Coiffeur

source: Registration failed.
ar: فشل التسجيل.
fr: Échec de l'inscription.

# pleaseAcceptTerms
source: Please accept the terms and conditions.
ar: الرجاء قبول الشروط والأحكام.
fr: Veuillez accepter les conditions générales.

# barberRegisterTitle
source: Barber Register
ar: تسجيل حلاق
fr: Inscription Coiffeur

# barberCreateAccount
source: Create Your Barber Account
ar: أنشئ حسابك كحلاق
fr: Créez votre compte Coiffeur

source: Get Started
ar: ابدأ
fr: Commencer

# pleaseEnterBarbershopName
source: Please enter your barbershop name
ar: يرجى إدخال اسم صالون الحلاقة الخاص بك
fr: Veuillez entrer le nom de votre salon de coiffure

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح
fr: Veuillez entrer un numéro de téléphone valide

# pleaseEnterLocation
source: Please enter your barbershop location
ar: يرجى إدخال موقع صالون الحلاقة الخاص بك
fr: Veuillez entrer l'emplacement de votre salon

source: Personal Information
ar: المعلومات الشخصية
fr: Informations Personnelles

source: Shop Information
ar: معلومات الصالون
fr: Informations sur le Salon

source: Barbershop Name
ar: اسم صالون الحلاقة
fr: Nom du Salon de Coiffure

# location
source: Barber located at
ar: موقع الحلاق
fr: Coiffeur situé à

source: Account Information
ar: معلومات الحساب
fr: Informations sur le Compte

# barberDescription
source: Manage your salon, services, and bookings.
ar: إدارة صالونك، خدماتك، وحجوزاتك.
fr: Gérez votre salon, vos services et vos réservations.

# clientDescription
source: Find the best barbers and book appointments.
ar: ابحث عن أفضل الحلاقين واحجز المواعيد.
fr: Trouvez les meilleurs barbiers et réservez des rendez-vous.

source: Password reset failed
ar: فشلت إعادة تعيين كلمة المرور
fr: La réinitialisation du mot de passe a échoué

# barberRegisterSubtitle
source: Sign up to manage your services.
ar: اشترك لإدارة خدماتك.
fr: Inscrivez-vous pour gérer vos services.

# acceptTerms
source: I accept the Terms and Conditions
ar: أوافق على الشروط والأحكام
fr: J'accepte les Conditions Générales

source: Please enter name
ar: الرجاء إدخال الاسم
fr: Veuillez entrer le nom

# barberAlreadyHaveAccount
source: Already have a barber account?
ar: هل لديك حساب حلاق بالفعل؟
fr: Vous avez déjà un compte ?

source: Password reset link sent!
ar: تم إرسال رابط إعادة تعيين كلمة المرور!
fr: Lien de réinitialisation envoyé !

# barberForgotPasswordSubtitle
source: Enter your email and we will send you a link to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك رابطًا لإعادة تعيين كلمة المرور الخاصة بك.
fr: Entrez votre email et nous vous enverrons un lien pour réinitialiser votre mot de passe.

# forgotPasswordTitle
source: Forgot Your Password?
ar: هل نسيت كلمة المرور؟
fr: Mot de passe oublié ?

source: Send Reset Link
ar: إعادة التعيين
fr: Réinitialiser

source: Reset Link Sent
ar: تم إرسال الرابط
fr: Lien Envoyé

source: I'm a Client
ar: أنا زبون
fr: Je suis un Client

# welcomeMessage
source: Welcome! Please select your role.
ar: مرحبًا! يرجى تحديد دورك.
fr: Bienvenue ! Veuillez sélectionner votre rôle.

# imABarber
source: I'm a Barber/Salon Owner
ar: أنا حلاق / مالك صالون
fr: Je suis un Coiffeur/Propriétaire de Salon

source: Working Hours
ar: ساعات العمل
fr: Horaires d'ouverture
