Repository: 1miiine/Blastty-
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Profile
ar: الملف الشخصي
fr: Profil

source: Logout
ar: تسجيل الخروج
fr: Se déconnecter

source: General Settings
ar: الإعدادات العامة
fr: Paramètres généraux

source: Dark Mode
ar: الوضع الداكن
fr: Mode sombre

source: Language
ar: اللغة
fr: Langue

source: About
ar: حول
fr: À propos

source: Help & Support
ar: المساعدة والدعم
fr: Aide et support

source: Phone Number
ar: رقم الهاتف
fr: Numéro de Téléphone

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك
fr: Veuillez entrer votre numéro de téléphone

source: Notifications
ar: الإشعارات

source: Barber registration successful
ar: تم تسجيل الحلاق بنجاح
fr: Inscription réussie de barbier

source: Notifications feature coming soon
ar: ميزة الإشعارات قادمة قريبًا
fr: Fonctionnalité des notifications bientôt disponible

source: Today bookings
ar: حجوزات اليوم
fr: Réservations d'aujourd'hui

source: Weekly earnings
ar: الأرباح الأسبوعية
fr: Gains hebdomadaires

# manageAppointments
source: Manage appointments, manage offerings, set availability, update info
ar: إدارة المواعيد، إدارة الخدمات، ضبط التوفر، تحديث المعلومات
fr: Gérer les rendez-vous, gérer les services, définir la disponibilité, mettre à jour les informations

source: Update info
ar: تحديث المعلومات
fr: Mettre à jour les informations

source: Favorites
ar: المفضلة
fr: Favoris

# tagExpert
source: Expert
ar: خبير

# tagSpecialOffer
source: Special Offer
ar: عرض خاص
fr: Offre spéciale

# tagPopular
source: Popular
ar: شائع
fr: Populaire

# tagTrending
source: Trending
ar: رائج
fr: Tendance

# tagRecommended
source: Recommended
ar: موصى به
fr: Recommandé

# tagVip
source: VIP
ar: كبار الشخصيات

source: Assign tags (optional)
ar: تعيين وسوم (اختياري)
fr: Attribuer des tags (optionnel)

source: Upload service image
ar: رفع صورة الخدمة
fr: Télécharger l'image du service

# updateServiceButton
source: Update Service
ar: تحديث الخدمة
fr: Mettre à jour le service

# addServiceButton
source: Add Service
ar: إضافة خدمة
fr: Ajouter un service

# formLabelDescription
source: Description
ar: الوصف

# formSuffixMinutes
source: minutes
ar: دقائق

# formValidationRequired
source: This field is required
ar: هذا الحقل مطلوب
fr: Ce champ est obligatoire

# formLabelDuration
source: Duration
ar: المدة
fr: Durée

# formLabelPrice
source: Price
ar: السعر
fr: Prix

# formValidationEnterName
source: Please enter a name
ar: الرجاء إدخال اسم
fr: Veuillez entrer un nom

# formLabelServiceName
source: Service Name
ar: اسم الخدمة
fr: Nom du service

# editServiceTitle
source: Edit Service
ar: تعديل الخدمة
fr: Modifier le service

# createServiceTitle
source: Create Service
ar: إنشاء خدمة
fr: Créer un service

source: An error occurred
ar: حدث خطأ
fr: Une erreur est survenue

source: Accept terms and conditions
ar: قبول الشروط والأحكام
fr: Accepter les termes et conditions

# forMenServices
source: Services for Men
ar: خدمات للرجال
fr: Services pour Hommes

# barbersNews
source: News for Hairdressers
ar: أخبار الحلاقين ومصففات الشعر
fr: Actualités des coiffeurs

# forWomenServices
source: Services for Women
ar: خدمات للنساء
fr: Services pour Femmes

# forYouFeedTitle
source: For You Feed
ar: من أجلكم
fr: Fil Pour Vous

source: Send Feedback
ar: إرسال ملاحظات
fr: Envoyer des commentaires

source: Help Center
ar: مركز المساعدة
fr: Centre d'aide

source: Total Visits
ar: إجمالي الزيارات
fr: Total des visites

source: Needs Follow-Up
ar: يحتاج متابعة
fr: Nécessite un suivi

source: Student Discount
ar: خصم الطلاب
fr: Réduction étudiant

source: New Client
ar: عميل جديد
fr: Nouveau client

source: Other
ar: أخرى
fr: Autre

source: Classic Cut
ar: قص كلاسيكي
fr: Coupe classique

source: Fade Haircut
ar: قص متدرج
fr: Dégradé

# january
source: Jan
ar: يناير

# february
source: Feb
ar: فبراير
fr: Fév

# march
source: Mar
ar: مارس

source: Needs extra time
ar: يحتاج وقت إضافي
fr: A besoin de plus de temps

source: Allergic to products
ar: يعاني من حساسية تجاه المنتجات
fr: Allergique aux produits

source: Prefers specific brand
ar: يفضل علامة تجارية محددة
fr: Préfère une marque spécifique

source: Premium beard trim
ar: تهذيب لحية فاخر
fr: Taille de barbe premium

# april
source: Apr
ar: أبريل
fr: Avr

source: May
ar: ماي
fr: Mai

# june
source: Jun
ar: يونيو
fr: Jui

source: No Shop Name
ar: لا يوجد اسم صالون
fr: Pas de nom de salon

source: Support
ar: الدعم

# forText
source: for
ar: لـ
fr: pour

source: to Booking For
ar: لحجز لـ
fr: pour la réservation de

source: New requests
ar: طلبات جديدة
fr: Nouvelles demandes

# servicePremiumBeardTrim
source: Premium Beard Trim
ar: حلاقة لحية فاخرة
fr: Taille de barbe premium

# servicePremiumBeardTrimDesc
source: A precise beard trim with premium care oils.
ar: تشذيب دقيق للحية مع زيوت عناية فاخرة.
fr: Une taille de barbe précise avec des huiles de soin premium.

# serviceClassicHaircut
source: Classic Haircut
ar: قَصّة كلاسيكية
fr: Coupe classique

# serviceClassicHaircutDesc
source: A timeless haircut tailored to your style.
ar: قَصّة شعر كلاسيكية تناسب أسلوبك.
fr: Une coupe intemporelle adaptée à votre style.

# july
source: Jul
ar: يوليوز
fr: Jui

# august
source: Aug
ar: غشت
fr: Aoû

# september
source: Sep
ar: شتنبر

# october
source: Oct
ar: أكتوبر

# november
source: Nov
ar: نونبر

# december
source: Dec
ar: دجنبر
fr: Déc

# serviceWeekendManicure
source: Weekend Manicure
ar: مناكير عطلة نهاية الأسبوع
fr: Manucure du week-end

# serviceWeekendManicureDesc
source: Relaxing manicure service for the weekend.
ar: خدمة مناكير مريحة لعطلة نهاية الأسبوع.
fr: Un service de manucure relaxant pour le week-end.

source: Edit Client
ar: تعديل الزبون
fr: Modifier le client

source: Editing...
ar: جارٍ التعديل...
fr: Modification...

# clientUpdated
source: Client information updated successfully.
ar: تم تحديث معلومات الزبون بنجاح.
fr: Informations du client mises à jour avec succès.

# serviceHotTowelShave
source: Hot Towel Shave
ar: الحلاقة بالمنشفة الساخنة
fr: Rasage à la serviette chaude

# serviceHotTowelShaveDesc
source: Traditional shave with hot towel treatment.
ar: حلاقة تقليدية مع علاج بالمنشفة الساخنة.
fr: Un rasage traditionnel avec un soin à la serviette chaude.

# serviceFullBodyWaxing
source: Full Body Waxing
ar: إزالة شعر الجسم بالكامل
fr: Épilation complète du corps

# serviceFullBodyWaxingDesc
source: Complete body waxing for smooth skin.
ar: إزالة كاملة للشعر لجسم ناعم.
fr: Épilation complète pour une peau lisse.

# serviceWomanHairColoring
source: Hair Coloring (Women)
ar: صبغة شعر (نساء)
fr: Coloration cheveux (femmes)

# serviceWomanHairColoringDesc
source: Professional hair coloring with vibrant shades.
ar: صبغة شعر احترافية بألوان زاهية.
fr: Coloration professionnelle avec des teintes éclatantes.

source: Decline
ar: انخفاض
fr: Refuser

source: At a glance
ar: في لمحة
fr: En bref

source: No Services Description
ar: لا يوجد وصف للخدمات
fr: Aucune description de service

source: No Services Title
ar: لا توجد خدمات
fr: Aucun service

# actionCannotBeUndone
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
fr: Cette action est irréversible

# areYouSureDelete
source: Are you sure you want to delete ?
ar: هل أنت متأكد أنك تريد الحذف؟
fr: Êtes-vous sûr de vouloir supprimer ?

source: Add Vacation Or Day Off Exceptions
ar: إضافة عطلة أو استثناء
fr: Ajouter des congés ou des exceptions

source: Add a Note (Optional)
ar: أضف ملاحظة (اختياري)
fr: Ajouter une note (facultatif)

source: Edit Schedule
ar: تعديل الجدول
fr: Modifier l'emploi du temps

source: Call
ar: اتصال
fr: Appeler

source: No completed bookings
ar: لا توجد حجوزات مكتملة
fr: Aucune réservation terminée

source: Your Bio
ar: نبذة عنك
fr: Votre biographie

source: Notification Channels
ar: قنوات الإشعارات
fr: Canaux de notification

source: this action cannot be undone
ar: هذا الإجراء لا يمكن التراجع عنه
fr: Cette action est irréversible

source: Are you sure you want to delete ?
ar: هل أنت متأكد أنك تريد الحذف؟
fr: Êtes-vous sûr de vouloir supprimer ?

source: Add Vacation Or Day Off
ar: إضافة عطلة أو يوم إجازة
fr: Ajouter des congés ou jours de repos

source: Exceptions
ar: الاستثناءات

source: Add Note (Optional)
ar: أضف ملاحظة (اختياري)
fr: Ajouter une note (facultatif)

source: View Report
ar: عرض التقرير
fr: Voir le rapport

source: Upcoming Bookings
ar: الحجوزات القادمة
fr: Réservations à venir

source: No Clients Yet
ar: لا يوجد عملاء بعد
fr: Pas encore de clients

source: Morning Peak
ar: ذروة الصباح
fr: Pic du matin

source: Quietest Period
ar: الفترة الأكثر هدوءًا
fr: Période la plus calme

# areYouSureYouWantToConfirm
source: Are you sure you want to confirm this booking with
ar: هل أنت متأكد أنك تريد تأكيد الحجز مع
fr: Êtes-vous sûr de vouloir confirmer cette réservation avec

source: About Me
ar: معلومات عني
fr: À propos de moi

source: Contact Details
ar: تفاصيل الاتصال
fr: Coordonnées

source: Your Name
ar: اسمك
fr: Votre nom

source: Public Information
ar: معلومات عامة
fr: Informations publiques

source: My Gallery
ar: معرضي
fr: Ma galerie

source: Reply To Message
ar: الرد على الرسالة
fr: Répondre au message

source: Messages
ar: الرسائل

source: No Notifications Yet
ar: لا توجد إشعارات بعد
fr: Pas encore de notifications

source: Recent
ar: الأحدث
fr: Récent

source: View All
ar: عرض الكل
fr: Tout voir

source: Stats
ar: إحصائيات
fr: Statistiques

source: Today
ar: اليوم
fr: Aujourd'hui

source: Switch to barber
ar: التبديل إلى الحلاق
fr: Passer au barbier

source: Revenue Management
ar: إدارة الإيرادات
fr: Gestion des revenus

source: No Bookings Today
ar: لا توجد حجوزات اليوم
fr: Aucune réservation aujourd'hui

# todaySchedule
source: Today's Schedule
ar: جدول اليوم
fr: Programme du jour

source: Confirm switch to user
ar: تأكيد التبديل إلى المستخدم
fr: Confirmer le passage à l'utilisateur

source: Your Dashboard Subtitle
ar: العنوان الفرعي للوحة التحكم
fr: Sous-titre de votre tableau de bord

source: Search Clients
ar: البحث عن عملاء...
fr: Rechercher des clients

source: No Clients Found
ar: لا يوجد عملاء لبحثك.
fr: Aucun client trouvé

source: Try Different Keywords
ar: جرّب كلمات مفتاحية أخرى
fr: Essayez d'autres mots-clés

source: Clients Appear Here
ar: سيظهر العملاء هنا
fr: Les clients apparaissent ici

source: All Caught Up
ar: لقد انتهيت من كل شيء
fr: Tout est à jour

source: Monthly Revenue
ar: الإيرادات الشهرية
fr: Revenus mensuels

source: Review them now
ar: مراجعة الآن
fr: examinez-les maintenant

source: Client
ar: عميل

# confirmClient
source: Are you sure you want to confirm this booking with
ar: هل أنت متأكد أنك تريد تأكيد الحجز مع
fr: Êtes-vous sûr de vouloir confirmer cette réservation avec

source: Last 7 Days
ar: آخر 7 أيام
fr: 7 derniers jours

source: Last 30 Days
ar: آخر 30 يومًا
fr: 30 derniers jours

source: Revenue
ar: الإيرادات
fr: Revenu

source: Time remaining
ar: الوقت المتبقي
fr: Temps restant

# minutes45
source: 45 minutes
ar: 45 دقيقة

source: Service duration
ar: مدة الخدمة
fr: Durée du service

source: Re-book Now
ar: إعادة الحجز الآن
fr: Re-réserver

source: Re-book Later
ar: إعادة الحجز لاحقًا
fr: Plus tard

source: Re-book
ar: إعادة الحجز
fr: Re-réserver

source: remaining
ar: متبقي
fr: restant

source: Week
ar: أسبوع
fr: Semaine

source: Selected Date
ar: التاريخ المحدد
fr: Date sélectionnée

source: Selected Time
ar: الوقت المحدد
fr: Heure sélectionnée

source: Month
ar: شهر
fr: Mois

source: Year
ar: سنة
fr: Année

source: Bookings Over Time
ar: الحجوزات على مر الوقت
fr: Réservations au fil du temps

source: Service Ranking
ar: ترتيب الخدمات
fr: Classement des services

source: Set Availability
ar: تحديد التوافر
fr: Définir la disponibilité

source: Manage Offerings
ar: إدارة الخدمات
fr: Gérer les services

source: Washing Hair
ar: غسل الشعر
fr: Lavage des cheveux

# selectedItem
source: Selected
ar: محدد
fr: Sélectionné

source: Hair Treatment
ar: علاج الشعر
fr: Traitement capillaire

source: Facial Treatment
ar: علاج الوجه
fr: Traitement du visage

source: Line Up
ar: تنسيق الحلاقة

source: Dreadlocks
ar: جدائل الشعر

source: Body Waxing
ar: إزالة الشعر من الجسم
fr: Épilation du corps

source: Manicure
ar: تجميل الأظافر
fr: Manucure

source: Post Comment
ar: نشر التعليق
fr: Publier le commentaire

source: Traditional Cuts
ar: قصات تقليدية
fr: Coupes Traditionnelles

source: Omar Classic
ar: عمر كلاسيك

source: Master Styling
ar: خبير التصفيف
fr: Maître Style

source: Khalid Elite
ar: خالد إيليت

source: Luxury Grooming
ar: العناية الفاخرة
fr: Soins de Luxe

source: Morad Premium
ar: مراد بريميوم

source: South Mall
ar: مول الجنوب
fr: Centre Commercial Sud

source: Urban Cuts
ar: قصات حضرية
fr: Coupes Urbaines

source: East District
ar: حي الشرق
fr: Quartier Est

source: Royal Barber
ar: الحلاق الملكي
fr: Barbier Royal

source: North Plaza
ar: ساحة الشمال
fr: Place Nord

source: Modern Styles
ar: أساليب عصرية
fr: Styles Modernes

# preparingBusinessInsights
source: Preparing your business insights...
ar: جارٍ إعداد رؤى عملك...
fr: Préparation de vos analyses commerciales...

source: Good morning,
ar: صباح الخير،
fr: Bonjour,

source: Good afternoon,
ar: مساء الخير،
fr: Bon après-midi,

source: Good evening,
ar: مساء الخير،
fr: Bonsoir,

source: Reviews
ar: التقييمات
fr: avis

source: Available
ar: متاح
fr: Disponible

source: Offline
ar: غير متصل
fr: Hors ligne

source: BUSINESS OVERVIEW
ar: نظرة عامة على العمل
fr: APERÇU DE L'ENTREPRISE

source: This Week
ar: هذا الأسبوع
fr: Cette semaine

source: This Month
ar: هذا الشهر
fr: Ce mois

source: Bookings
ar: الحجوزات
fr: Réservations

source: Total Bookings
ar: إجمالي الحجوزات
fr: Réservations totales

source: TOP PERFORMING SERVICES
ar: أفضل الخدمات أداءً
fr: SERVICES LES PLUS PERFORMANTS

# noPopularServices
source: No popular services yet
ar: لا توجد خدمات شائعة بعد
fr: Aucun service populaire pour le moment

source: Total Revenue
ar: إجمالي الإيرادات
fr: Revenus Totaux

source: Average per Booking
ar: المتوسط لكل حجز
fr: Moyenne par réservation

source: Growth Rate
ar: معدل النمو
fr: Taux de croissance

source: View Full Analytics
ar: عرض التحليلات الكاملة
fr: Voir les analyses complètes

source: PERFORMANCE METRICS
ar: مقاييس الأداء
fr: MÉTRIQUES DE PERFORMANCE

source: Today's Bookings
ar: حجوزات اليوم
fr: Réservations d'aujourd'hui

source: Pending Requests
ar: الطلبات المعلقة
fr: Demandes en attente

source: Completion Rate
ar: معدل الإنجاز
fr: Taux d'achèvement

source: Customer Satisfaction
ar: رضا العملاء
fr: Satisfaction client

source: REVENUE TREND
ar: اتجاه الإيرادات
fr: TENDANCE DES REVENUS

source: View Details
ar: عرض التفاصيل
fr: Détails

source: Peak Revenue Day
ar: يوم الإيرادات القصوى
fr: Jour de revenu maximal

source: Average Daily Revenue
ar: متوسط الإيرادات اليومية
fr: Revenu quotidien moyen

source: Consistent performance
ar: أداء متسق
fr: Performance constante

source: SERVICE ANALYTICS
ar: تحليلات الخدمات
fr: ANALYSE DES SERVICES

source: Manage
ar: إدارة
fr: Gérer

source: Booking postponed
ar: تم تأجيل الحجز!
fr: Réservation reportée

source: Booking cancelled
ar: تم إلغاء الحجز
fr: Réservation annulée

source: Booking confirmed
ar: تم تأكيد الحجز
fr: Réservation confirmée

source: Postpone booking
ar: تأجيل الحجز
fr: Reporter

source: Cancel Booking
ar: إلغاء الحجز
fr: Annuler

source: Confirm booking
ar: تأكيد الحجز
fr: Confirmer la réservation

source: Manage booking
ar: إدارة الحجز
fr: Gérer la réservation

source: Next booking
ar: الحجز القادم
fr: Prochaine réservation

# todaySummary
source: Today's summary
ar: ملخص اليوم
fr: Résumé du jour

source: Total Services
ar: إجمالي الخدمات
fr: Services Totaux

source: Popular Services
ar: الخدمات الشائعة
fr: Services populaires

source: Avg. Service Price
ar: متوسط سعر الخدمة
fr: Prix moyen des services

source: TOP SERVICES
ar: أفضل الخدمات
fr: MEILLEURS SERVICES

# noServices
source: No services yet
ar: لا توجد خدمات بعد
fr: Aucun service pour le moment

source: PRODUCTIVITY BOOSTERS
ar: معززات الإنتاجية
fr: BOOSTEURS DE PRODUCTIVITÉ

source: Review Pending Bookings
ar: مراجعة الحجوزات المعلقة
fr: Examiner les réservations en attente

source: Pending Booking Requests
ar: طلبات الحجز المعلقة
fr: Demandes de réservation en attente

source: All Clear!
ar: كل شيء واضح!
fr: Tout est clair !

# noPendingBookings
source: No pending bookings at the moment
ar: لا توجد حجوزات معلقة في الوقت الحالي
fr: Aucune réservation en attente pour le moment

source: Optimize Schedule
ar: تحسين الجدول
fr: Optimiser le calendrier

source: Review today's
ar: مراجعة
fr: Examiner les

source: appointments
ar: المواعيد
fr: Rendez-vous

source: Update Services
ar: تحديث الخدمات
fr: Mettre à jour les services

# keepServicePortfolioFresh
source: Keep your service portfolio fresh
ar: احتفظ بمحفظة خدماتك محدثة
fr: Gardez votre portfolio de services à jour

source: QUICK ACCESS
ar: الوصول السريع
fr: ACCÈS RAPIDE

source: Dashboard
ar: لوحة التحكم
fr: Tableau de bord

source: Services
ar: الخدمات

source: Analytics
ar: التحليلات
fr: Analyses

source: Settings
ar: الإعدادات
fr: Paramètres

source: Switch to User Mode
ar: التبديل إلى وضع المستخدم
fr: Passer en mode utilisateur

source: No email provided
ar: لم يتم تقديم بريد إلكتروني
fr: Aucun email fourni

source: Popular
ar: شعبي
fr: Populaire

# hello
source: Hello {userName}!
ar: مرحباً {userName}!
fr: Bonjour {userName} !

source: Utilization Rate
ar: معدل الاستخدام
fr: Taux d'utilisation

source: Capacity
ar: القدرة الاستيعابية
fr: Capacité

source: View Detailed Report
ar: عرض التقرير التفصيلي
fr: Voir le rapport détaillé

# reportAndAnalysis
source: Report & Analysis
ar: التقرير والتحليل
fr: Rapport et analyse

source: Monthly Booking Trends
ar: اتجاهات الحجوزات الشهرية
fr: Tendances mensuelles des réservations

source: Average Monthly Bookings
ar: متوسط الحجوزات الشهرية
fr: Moyenne mensuelle des réservations

source: Busiest Hours
ar: أوقات الذروة
fr: Heures de pointe

source: Off-Peak Hour
ar: ساعة خارج الذروة
fr: Heure creuse

source: Peak Hour
ar: ساعة الذروة
fr: Heure de pointe

source: Bookings by hour
ar: الحجوزات حسب الساعة
fr: Réservations par heure

source: Bookings last 6 months
ar: الحجوزات خلال آخر 6 أشهر
fr: Réservations des 6 derniers mois

source: Revenue last 6 months
ar: الإيرادات خلال آخر 6 أشهر
fr: Revenus des 6 derniers mois

source: Monthly bookings
ar: الحجوزات الشهرية
fr: Réservations mensuelles

source: Average Wait Time
ar: متوسط وقت الانتظار
fr: Temps d’attente moyen

source: Edit Weekly Template
ar: تعديل القالب الأسبوعي
fr: Modifier le modèle hebdomadaire

source: Day Off
ar: يوم عطلة
fr: Jour de repos

source: Set
ar: تعيين
fr: Définir

# removeBreak
source: Remove
ar: إزالة
fr: Supprimer

source: End
ar: انتهاء
fr: Fin

source: Start
ar: بداية
fr: Début

source: Set break time
ar: تعيين وقت الاستراحة
fr: Définir l’heure de pause

source: Done
ar: تم
fr: Terminé

source: Select break duration
ar: حدد مدة الاستراحة
fr: Sélectionnez la durée de la pause

source: Welcome back
ar: مرحبًا بعودتك
fr: Bienvenue

source: Today's Revenue
ar: إيراد اليوم
fr: Revenu du jour

source: Quick tools
ar: أدوات سريعة
fr: Outils rapides

# addNewBooking
source: Booking
ar: حجز
fr: Réserver

source: Add new service
ar: إضافة خدمة جديدة
fr: Ajouter un nouveau service

source: Manage Schedule
ar: إدارة الجدول
fr: Gérer le planning

source: Your Focus for Today
ar: تركيزك لليوم
fr: Votre objectif pour aujourd'hui

source: New clients
ar: عملاء جدد
fr: Nouveaux clients

source: Schedule Gaps
ar: فجوات في الجدول
fr: Créneaux disponibles

source: No upcoming bookings
ar: لا توجد حجوزات قادمة
fr: Aucune réservation à venir

source: Service
ar: الخدمة

source: Time
ar: الوقت
fr: Heure

source: Ongoing
ar: قيد التنفيذ
fr: En cours

source: Upcoming
ar: القادم
fr: À venir

source: History
ar: تاريخ
fr: Historique

# noBookingsInSection
source: No bookings in this section
ar: لا توجد حجوزات في هذا القسم
fr: Aucune réservation dans cette section

source: Reschedule
ar: إعادة الجدولة
fr: Reporter

source: Cancel
ar: إلغاء
fr: Annuler

source: LIVE
ar: مباشر
fr: EN DIRECT

source: Now in Progress
ar: قيد التنفيذ الآن
fr: En cours

source: Started at
ar: بدأ في
fr: Commencé à

# estimatedCompletion
source: Est. Completion
ar: الانتهاء المتوقع
fr: Fin estimée

source: Status
ar: الحالة
fr: Statut

source: Client Checked In
ar: تسجيل دخول الزبون
fr: Client arrivé

source: Add Time
ar: إضافة وقت
fr: Ajouter du temps

source: Complete
ar: إكمال
fr: Terminer

source: Price
ar: السعر
fr: Prix

source: Are you sure to confirm for
ar: هل أنت متأكد من التأكيد ل
fr: Êtes-vous sûr de confirmer pour

source: Duration
ar: المدة
fr: Durée

source: Close
ar: إغلاق
fr: Fermer

source: Reschedule Booking
ar: إعادة جدولة الحجز
fr: Reporter la réservation

# selectTimeToPostpone
source: Select a time to postpone by, or enter a custom amount in minutes.
ar: اختر وقت التأجيل أو أدخل مدة مخصصة بالدقائق.
fr: Sélectionnez un temps de report ou entrez une durée personnalisée en minutes.

# surePostponeBy
source: Are you sure you want to postpone by
ar: هل أنت متأكد من التأجيل لمدة
fr: Êtes-vous sûr de vouloir reporter de

source: Rescheduled by
ar: تم التأجيل لمدة
fr: Reporté de

source: minutes
ar: {minutes} دقيقة

source: Custom Minutes
ar: دقائق مخصصة
fr: Minutes personnalisées

source: Add Time to Booking
ar: إضافة وقت إلى الحجز
fr: Ajouter du temps à la réservation

# selectTimeToAdd
source: Select a time to add, or enter a custom amount in minutes.
ar: اختر وقت الإضافة أو أدخل مدة مخصصة بالدقائق.
fr: Sélectionnez un temps à ajouter ou entrez une durée personnalisée en minutes.

# sureAddMinutes
source: Are you sure you want to add
ar: هل أنت متأكد من إضافة
fr: Êtes-vous sûr d'ajouter

source: to this booking
ar: إلى هذا الحجز
fr: à cette réservation

source: Added
ar: تمت الإضافة
fr: Ajouté

source: Clients
ar: العملاء

source: Client Opportunities
ar: فرص العملاء
fr: Opportunités clients

source: Book Again
ar: احجز مرة أخرى
fr: Réserver à nouveau

source: High Value
ar: عالية القيمة
fr: Haute valeur

source: Quick Filters
ar: فلاتر سريعة
fr: Filtres rapides

source: All Clients
ar: جميع العملاء
fr: Tous les clients

source: Regulars
ar: منتظمون
fr: Réguliers

# noClientsMatchFilter
source: No clients match the selected filter.
ar: لا يوجد عملاء يتطابقون مع الفلتر المحدد.
fr: Aucun client ne correspond au filtre sélectionné.

source: Member since
ar: عضو منذ
fr: Membre depuis

source: Last Visit
ar: آخر زيارة
fr: Dernière visite

source: Notes
ar: ملاحظات

source: Send Reminder
ar: إرسال تذكير
fr: Envoyer un rappel

source: Confirm Reminder
ar: تأكيد التذكير
fr: Confirmer le rappel

# sendReminderTo
source: Send a booking reminder to
ar: إرسال تذكير حجز إلى
fr: Envoyer un rappel de réservation à

source: for their appointment on
ar: لحجزهم في
fr: pour leur rendez-vous le

source: at
ar: في
fr: à

source: Your Services
ar: خدماتك
fr: Vos Services

source: Service Intelligence
ar: ذكاء الخدمة
fr: Intelligence des Services

source: Most Booked
ar: الأكثر حجزاً
fr: Plus Réservés

source: Top Earners
ar: أعلى الإيرادات
fr: Meilleurs Gains

source: Quickest
ar: الأسرع
fr: Les Plus Rapides

# noServicesMatchFilter
source: No services match the selected filter.
ar: لا توجد خدمات تتطابق مع الفلتر المحدد.
fr: Aucun service ne correspond au filtre sélectionné.

source: Delete Service
ar: حذف الخدمة
fr: Supprimer le Service

# sureDeleteService
source: Are you sure you want to delete
ar: هل أنت متأكد من حذف
fr: Êtes-vous sûr de vouloir supprimer

source: Service Deleted
ar: تم حذف الخدمة
fr: Service Supprimé

source: Yes, Delete
ar: نعم، احذف
fr: Oui, Supprimer

source: No description provided.
ar: لا يوجد وصف مقدم.
fr: Aucune description fournie.

source: Edit Service
ar: تعديل
fr: Modifier le Service

source: Are you sure?
ar: هل أنت متأكد أنك تريد {action} هذا الحجز؟
fr: Êtes-vous sûr ?

source: Reminder Sent!
ar: تم إرسال التذكير!
fr: Rappel envoyé !

source: Yes, Send Reminder
ar: نعم، أرسل التذكير
fr: Oui, envoyer le rappel

source: Add New Client
ar: إضافة عميل جديد
fr: Ajouter un nouveau client
